{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/project2/blattman/liberia/liberia/logs/analysis_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}20 Sep 2018, 14:56:39
{txt}
{com}. 
. ********************************************************************************
. * Set the directory for the frmttable ado file *********************************
. ********************************************************************************
. qui adopath ++ ./ado
{txt}
{com}. 
. 
. ********************************************************************************
. * Do the importing and merging *************************************************
. ********************************************************************************
. /*      Don't run import_from_external. It's a mess and contains global paths. We can 
>         forget about it for now. 
> */
. 
.         *       imports the data
.         *       censors outliers 
.         *       makes some global variables for covariates 
.         *       imputes missing values to median for select variables
.         *       adds correct suffixes to variables
.         *       constructs variables relating to 
.                 *       voilent disputes
.                 *       security 
.                 *       use and improvement of land
.                 *       ownership of land
.         do do/import_clean_construct
{txt}
{com}. 
. ********************************************************************************
. * Import the dataset ***********************************************************
. ********************************************************************************
. /*      Original location of this data: 
> "IPA Liberia Peace CoRE/DATA/Analysis/PEACE/Data/jpc_analysis_test.dta"
> */
. 
. 
.         clear 
{txt}
{com}.         clear mata 
{txt}
{com}.         clear matrix 
{txt}
{com}.         set maxvar 6000

{txt}
{com}.         use data/jpc_analysis_test, clear
{txt}
{com}.         set more off
{txt}
{com}. 
. 
. ********************************************************************************
. * Make adjustments to the dataset **********************************************
. ********************************************************************************
. 
. * Outliers and extreme values **********************************************
. foreach x of varlist farm_size_et land_size_et farm_size_ec land_size_ec {c -(}
{txt}  2{com}. 
.         local lbl : variable label `x'                  
{txt}  3{com}.         gen `x'p95c=`x'
{txt}  4{com}.         sum `x',d
{txt}  5{com}.         replace `x'p95c=r(p95) if `x'>r(p95) & `x'!=.
{txt}  6{com}.         la var `x'p95 "`lbl' capped at p95"
{txt}  7{com}. {c )-}               
{txt}(15,503 missing values generated)

                      Farm size (acres)
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        634
{txt}25%    {res}        1              0       {txt}Sum of Wgt. {res}        634

{txt}50%    {res}        3                      {txt}Mean          {res} 7.055599
                        {txt}Largest       Std. Dev.     {res} 18.67291
{txt}75%    {res}        7            160
{txt}90%    {res}     13.5            200       {txt}Variance      {res} 348.6775
{txt}95%    {res}       21            200       {txt}Skewness      {res} 7.639257
{txt}99%    {res}      100            200       {txt}Kurtosis      {res}  70.3528
{txt}(31 real changes made)
(15,503 missing values generated)

                      Land size (acres)
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        634
{txt}25%    {res}        3              0       {txt}Sum of Wgt. {res}        634

{txt}50%    {res}        9                      {txt}Mean          {res} 38.77879
                        {txt}Largest       Std. Dev.     {res} 60.21985
{txt}75%    {res}       45            200
{txt}90%    {res}      150            200       {txt}Variance      {res}  3626.43
{txt}95%    {res}      200            200       {txt}Skewness      {res} 1.732443
{txt}99%    {res}      200            200       {txt}Kurtosis      {res} 4.646923
{txt}(0 real changes made)
(11,336 missing values generated)

                      Farm size (acres)
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      4,801
{txt}25%    {res}      .25              0       {txt}Sum of Wgt. {res}      4,801

{txt}50%    {res}        2                      {txt}Mean          {res} 5.570975
                        {txt}Largest       Std. Dev.     {res} 18.85894
{txt}75%    {res}        5            300
{txt}90%    {res}       10            300       {txt}Variance      {res} 355.6597
{txt}95%    {res}       15            300       {txt}Skewness      {res} 10.96462
{txt}99%    {res}     67.5            300       {txt}Kurtosis      {res} 145.9503
{txt}(221 real changes made)
(11,336 missing values generated)

                      Land size (acres)
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      4,801
{txt}25%    {res}        1              0       {txt}Sum of Wgt. {res}      4,801

{txt}50%    {res}        5                      {txt}Mean          {res} 26.82472
                        {txt}Largest       Std. Dev.     {res} 52.15108
{txt}75%    {res}       18            200
{txt}90%    {res}      100            200       {txt}Variance      {res} 2719.735
{txt}95%    {res}      200            200       {txt}Skewness      {res} 2.427945
{txt}99%    {res}      200            200       {txt}Kurtosis      {res} 7.746046
{txt}(0 real changes made)

{com}. 
. * Impute median for missing data *******************************************
. foreach x of varlist age_ec age_et age_ec2 {c -(}
{txt}  2{com}.         qui sum `x',d
{txt}  3{com}.         replace `x'=r(p50) if `x'==.
{txt}  4{com}.         
. {c )-}
{txt}(11,338 real changes made)
(15,503 real changes made)
(12,126 real changes made)

{com}.                                         
. 
. ********************************************************************************
. * Generate weights we will use in the analysis *********************************
. ********************************************************************************
. // Generate sampling weight: the inverse probability of being sampled
.         * s_weight1 is used for community member regressions
.         * s_weight2 is used for leader, trainee, and community-level regressions (b/c their probability of seleciton is 1)
.         * s_weight3 is used for community member regressions or sum stats at baseline
.                 * Note: transforming weights to have a mean of 1 changes neither coeffs nor se's.
.         
. gen s_weight1=1/(commcount_ec/popest2)
{txt}(49 missing values generated)

{com}.         la var s_weight1 "inverse prob. of selection (endline)"
{txt}
{com}. 
. gen s_weight2=1
{txt}
{com}.         la var s_weight2 "1 for all observations--no weighting for differntial probability of selection within communities"     
{txt}note: label truncated to 80 characters

{com}. 
. gen s_weight3=1/(commcount_bc/popest2)
{txt}(3 missing values generated)

{com}.         la var s_weight3 "inverse prob. of selection (baseline)"
{txt}
{com}. 
. gen s_weight4=s_weight1
{txt}(49 missing values generated)

{com}. replace s_weight4=1 if TARGETED_RESIDENT==1 | ENDLINE_LEADER==1
{txt}(1,574 real changes made)

{com}.         la var s_weight4 "inverse prob. of selection for C; 1 for T & L"
{txt}
{com}.         
. **NOTE: due to the dropping of 40 control communities, weight_ec2 will be used for the endline2 analysis.
. 
. 
. 
. 
. 
. ********************************************************************************
. * Clean the data related to Treatment status ***********************************
. ********************************************************************************
. 
. gen START_TREATMENT_DATA=.
{txt}(16,137 missing values generated)

{com}. la var START_TREATMENT_DATA "========== START TREATMENT DATA ============"
{txt}
{com}. 
. * Assigned to treatment
. 
. ren impl_befroct assigned
{res}{txt}
{com}.         la var assigned "Randomly assigned to be treated by October 2010"       
{txt}
{com}. 
. replace assigned_nov = 0 if assigned==1
{txt}(140 real changes made)

{com}.         la var assigned_nov "Randomly assigned to be treated during November/December 2010"     
{txt}
{com}. 
. gen assigned_ever = (assigned==1 | assigned_nov==1)
{txt}
{com}.         la var assigned_ever "Randomly assigned to be treated by November/December 2010"        
{txt}
{com}. 
. replace intense = 0 if assigned==0
{txt}(642 real changes made)

{com}. 
. gen blocks1to5 = (block!=0)
{txt}
{com}.         la var blocks1to5 "Randomly assigned to Blocks 1 to 5 (i.e. original assignment)"       
{txt}
{com}. 
. gen assigned_dropped = (blocks1to5==1 & assigned_ever==0)
{txt}
{com}.         la var assigned_dropped "Randomly assigned to Blocks 1 to 5 but randomly not treated (in reassignment)" 
{txt}
{com}. 
. 
. * Treated
. 
. gen treated_oct=(assigned==1 & jpc_treat>0)
{txt}
{com}. replace treated_oct=0 if commcode==2010 | commcode==2660 
{txt}(140 real changes made)

{com}.         la var treated_oct "Treated by October 2010" 
{txt}
{com}. 
. gen treated_nov=(assigned_nov==1 & jpc_treat>0)
{txt}
{com}. replace treated_nov=1 if commcode==2010 | commcode==2660 
{txt}(140 real changes made)

{com}.         la var treated_nov "Treated during Nov/Dec 2010" 
{txt}
{com}. 
. gen treated_ever=(treated_oct==1 | treated_nov==1)
{txt}
{com}.         la var treated_ever "Treated ever" 
{txt}
{com}. 
. * Months since implementation
.         
. des impl*_month

              {txt}storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:impl1_month    }{txt}{bind: str7    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}Treatment: month 1 of implementation{p_end}
{p 0 48}{bind:impl2_month    }{txt}{bind: str7    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}Treatment: month 2 of implementation{p_end}
{p 0 48}{bind:impl3_month    }{txt}{bind: str7    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}Treatment: month 3 of implementation{p_end}
{p 0 48}{bind:impl4_month    }{txt}{bind: str7    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}Treatment: month 4 of implementation{p_end}
{p 0 48}{bind:impl5_month    }{txt}{bind: str7    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}Treatment: month 5 of implementation{p_end}
{txt}
{com}. forvalues i = 1/5 {c -(}
{txt}  2{com}.         gen month`i'=monthly(impl`i'_month, "MY")                                               // Returns stata assigned # for month of survey between 590 (3/2009) and 611 (12/2010)
{txt}  3{com}.         gen month`i'_bfr_impl=611-month`i'                                                              // Months before December (survey month 611) 
{txt}  4{com}.         gen weighted_monthbfr`i'= month`i'_bfr_impl*impl`i'_month_num   // Months before december weighted by number of workshops in that month
{txt}  5{com}. {c )-}       
{txt}(10,423 missing values generated)
(10,423 missing values generated)
(10,423 missing values generated)
(12,139 missing values generated)
(12,139 missing values generated)
(12,139 missing values generated)
(15,646 missing values generated)
(15,646 missing values generated)
(15,646 missing values generated)
(15,929 missing values generated)
(15,929 missing values generated)
(15,929 missing values generated)
(15,929 missing values generated)
(15,929 missing values generated)
(15,929 missing values generated)

{com}. 
. egen tot_workshops=rowtotal(impl1_month_num impl2_month_num impl3_month_num impl4_month_num impl5_month_num )                                   // total number of workshops implemented
{txt}
{com}. egen tot_month_weight=rowtotal(weighted_monthbfr1 weighted_monthbfr2 weighted_monthbfr3 weighted_monthbfr4 weighted_monthbfr5)  // weighted by months since implementation
{txt}
{com}. 
. gen months_treated=tot_month_weight/tot_workshops
{txt}(10,423 missing values generated)

{com}. replace months_treated=0 if assigned_nov==1
{txt}(1,127 real changes made)

{com}.         la var months_treated "# months b/t impl. of assigned_oct and _nov communities and the survey (weighted)"
{txt}note: label truncated to 80 characters

{com}. 
. gen lmonths_treated=ln(1+months_treated)
{txt}(10,212 missing values generated)

{com}. 
. 
. * Get a good date of the Endline 2 interview ***********************************
. split datetime_ec2, generate(t)
{res}variables created as string: 
{txt}{col 1}t1{col 5}t2

{com}. drop t2
{txt}
{com}. gen date_ec2 = date(t1, "MDY")
{txt}(12,127 missing values generated)

{com}. 
. * Some dates are in 2007, replace those with the median date *******************
. sum date_ec2, detail

                          {txt}date_ec2
{hline 61}
      Percentiles      Smallest
 1%    {res}    19423          17167
{txt} 5%    {res}    19426          17167
{txt}10%    {res}    19429          17167       {txt}Obs         {res}      4,010
{txt}25%    {res}    19439          17167       {txt}Sum of Wgt. {res}      4,010

{txt}50%    {res}    19455                      {txt}Mean          {res} 19448.23
                        {txt}Largest       Std. Dev.     {res} 135.5583
{txt}75%    {res}    19473          19517
{txt}90%    {res}    19485          19517       {txt}Variance      {res} 18376.05
{txt}95%    {res}    19489          19518       {txt}Skewness      {res}-15.78347
{txt}99%    {res}    19495          19519       {txt}Kurtosis      {res}  256.604
{txt}
{com}. replace date_ec2 = r(p50) if (date_ec2 < date("01jan2008", "DMY") & !missing(date_ec2))
{txt}(15 real changes made)

{com}. 
. gen t = date(impl1_month, "MY")
{txt}(10,423 missing values generated)

{com}. gen months_treated_ec2 = date_ec2 - t
{txt}(14,525 missing values generated)

{com}. replace months_treated_ec2 = floor(months_treated_ec2 / 30.5)
{txt}(1,612 real changes made)

{com}. 
. replace months_treated_ec2 = 0 if ((ENDLINE2_RESIDENT == 1 | ENDLINE2_LEADER == 1) & (assigned_ever == 0 | missing(months_treated_ec2))) 
{txt}(3,371 real changes made)

{com}. 
. label var months_treated_ec2 "Months since treatment at second endline"
{txt}
{com}. 
. gen years_treated_ec2 = months_treated_ec2 / 12
{txt}(11,154 missing values generated)

{com}. label var years_treated_ec2 "Years since treatment at second endline"
{txt}
{com}. 
. replace years_treated_ec2 = months_treated / 12 if (ENDLINE_RESIDENT == 1 | ENDLINE_LEADER == 1 | TARGETED_RESIDENT == 1)
{txt}(2,227 real changes made)

{com}. replace years_treated_ec2 = . if ((ENDLINE_RESIDENT == 1 | ENDLINE_LEADER == 1 | TARGETED_RESIDENT == 1) & (assigned_ever == 0 | missing(months_treated)))
{txt}(0 real changes made)

{com}. //replace years_treated_ec2 = . if years_treated_ec2 == 0 & ENDLINE2_RESIDENT == 1
. drop month1-tot_month_weight
{txt}
{com}.                 
. * Assigned to Block 1, Block 34 dummy and TOT counterparts
.         * Note: Some block 3 4 communities not actually assigned due to implementing capacity constraints. 
.         * AH and BSM randomized implementation in Block34 and this is accounted for in "assigned"
.                                         
. gen block1 = (block==1) 
{txt}
{com}.         la var block1 "Treatment block 1"
{txt}
{com}. 
. gen block2 = (block==2) 
{txt}
{com}.         la var block2 "Treatment block 2"
{txt}
{com}. 
. gen block12 = (block==1 | block==2)                                             // all of blocks 1 and 2 were implemented
{txt}
{com}.         la var block12 "Treatment block 1/2"
{txt}
{com}. 
. gen block3 = (block==3) 
{txt}
{com}.         la var block3 "Treatment block 3"
{txt}
{com}. 
. gen block4 = (block==4) 
{txt}
{com}.         la var block4 "Treatment block 4"
{txt}
{com}. 
. gen block5 = (block==5) 
{txt}
{com}.         la var block5 "Treatment block 5"
{txt}
{com}. 
. gen block4a = (block==4 & assigned==1)                                                  // includes only those block 4 members assigned to Oct (i.e. reassigned to block 3)
{txt}
{com}.         la var block4a "4 from Block 4 assigned to treatment"
{txt}
{com}. 
. gen block4b = (assigned_nov==1)                                                         // includes only those block 16 members assigned to Nov/Dec
{txt}
{com}.         la var block4b "16 from Block 4 assigned to late treatment concurrent with survey"
{txt}
{com}. 
. gen block4c = (block4==1 & block4a==0 & block4b==0)                                                     
{txt}
{com}.         la var block4c "the rest from Block 4 assigned to control"
{txt}
{com}.         
. gen block4c5 = (block4c==1 | block5==1)                                                         
{txt}
{com}.         la var block4c5 "Those randomly reassigned to control"
{txt}
{com}.         
. 
. * % of town implemented for use in spillover analysis
. 
. ** prop_treated3 using ctownpop_el2?
. gen prop_treated=cond(treated_oct==1, jpc_treat*35/ctownpop_el,0)
{txt}
{com}.         la var prop_treated "% of town treated (endline population estimates)"
{txt}
{com}. gen prop_treated2=cond(treated_oct==1, jpc_treat*35/ctownpop_bl,0)
{txt}
{com}.         la var prop_treated2 "% of town treated (baseline population estimates)"
{txt}
{com}. 
. ** adultprop_treated3 using ctownpop_el2?
. gen adultprop_treated=cond(treated_oct ==1, jpc_treat*35/(ctownpop_el*(1.7/3.5)),0) // town population scaled by the % of adult population from http://www.unicef.org/wcaro/wcaro_liberia_fact_CP_indicators.pdf
{txt}
{com}.         la var adultprop_treated "% of town treated (endline population estimates)" 
{txt}
{com}. gen adultprop_treated2=cond(treated_oct ==1, jpc_treat*35/(ctownpop_bl*(1.7/3.5)),0)
{txt}
{com}.         la var adultprop_treated2 "% of town treated (baseline population estimates)" // town population scaled by the % of adult population from http://www.unicef.org/wcaro/wcaro_liberia_fact_CP_indicators.pdf
{txt}
{com}.                 
. pwcorr prop_treated prop_treated2 if COMMLEVEL==1

             {txt}{c |} prop_t~d prop_t~2
{hline 13}{c +}{hline 18}
prop_treated {c |} {res}  1.0000 
{txt}prop_treat~2 {c |} {res}  0.8101   1.0000 
{txt}
{com}. sum prop_treated if  treated_oct==1 & COMMLEVEL==1,d                                    

      {txt}% of town treated (endline population estimates)
{hline 61}
      Percentiles      Smallest
 1%    {res} .0082006       .0082006
{txt} 5%    {res} .0143974       .0096552
{txt}10%    {res} .0159963       .0116667       {txt}Obs         {res}         68
{txt}25%    {res} .0329038       .0143974       {txt}Sum of Wgt. {res}         68

{txt}50%    {res} .0555003                      {txt}Mean          {res} .0956323
                        {txt}Largest       Std. Dev.     {res} .1563643
{txt}75%    {res}  .093752       .3482587
{txt}90%    {res} .2153846       .3664922       {txt}Variance      {res} .0244498
{txt}95%    {res} .3482587       .4635762       {txt}Skewness      {res} 5.162185
{txt}99%    {res} 1.166667       1.166667       {txt}Kurtosis      {res} 34.09681
{txt}
{com}. sum prop_treated2 if  treated_oct==1 & COMMLEVEL==1,d                                   

      {txt}% of town treated (baseline population estimates)
{hline 61}
      Percentiles      Smallest
 1%    {res}     .014           .014
{txt} 5%    {res} .0401837       .0375033
{txt}10%    {res} .0444162       .0386527       {txt}Obs         {res}         68
{txt}25%    {res} .0532615       .0401837       {txt}Sum of Wgt. {res}         68

{txt}50%    {res} .0698707                      {txt}Mean          {res} .0920196
                        {txt}Largest       Std. Dev.     {res}  .071537
{txt}75%    {res} .1118744         .15625
{txt}90%    {res}      .14       .2583026       {txt}Variance      {res} .0051175
{txt}95%    {res}   .15625            .35       {txt}Skewness      {res} 3.624656
{txt}99%    {res}       .5             .5       {txt}Kurtosis      {res} 19.13779
{txt}
{com}. sum adultprop_treated if  treated_oct==1 & COMMLEVEL==1,d                                       

      {txt}% of town treated (endline population estimates)
{hline 61}
      Percentiles      Smallest
 1%    {res} .0168835       .0168835
{txt} 5%    {res} .0296416       .0198783
{txt}10%    {res} .0329336       .0240196       {txt}Obs         {res}         68
{txt}25%    {res}  .067743       .0296416       {txt}Sum of Wgt. {res}         68

{txt}50%    {res} .1142654                      {txt}Mean          {res} .1968899
                        {txt}Largest       Std. Dev.     {res} .3219264
{txt}75%    {res} .1930189       .7170032
{txt}90%    {res} .4434389       .7545426       {txt}Variance      {res} .1036366
{txt}95%    {res} .7170032       .9544215       {txt}Skewness      {res} 5.162185
{txt}99%    {res} 2.401961       2.401961       {txt}Kurtosis      {res} 34.09682
{txt}
{com}. sum adultprop_treated2 if  treated_oct==1 & COMMLEVEL==1,d                                      

      {txt}% of town treated (baseline population estimates)
{hline 61}
      Percentiles      Smallest
 1%    {res} .0288235       .0288235
{txt} 5%    {res} .0827311       .0772128
{txt}10%    {res} .0914452        .079579       {txt}Obs         {res}         68
{txt}25%    {res}  .109656       .0827311       {txt}Sum of Wgt. {res}         68

{txt}50%    {res} .1438513                      {txt}Mean          {res}  .189452
                        {txt}Largest       Std. Dev.     {res} .1472822
{txt}75%    {res} .2303296       .3216912
{txt}90%    {res} .2882353       .5317994       {txt}Variance      {res}  .021692
{txt}95%    {res} .3216912       .7205882       {txt}Skewness      {res} 3.624656
{txt}99%    {res} 1.029412       1.029412       {txt}Kurtosis      {res} 19.13779
{txt}
{com}.                         
. * Where only 1 TARGETED RESIDENT found in community, we dump into catch-all, by county, and use this version of commcode for clustering. 
.         
. tab county, gen(county)

  {txt}Treatment: {c |}
      County {c |}      Freq.     Percent        Cum.
{hline 13}{c +}{hline 35}
Grand Geddeh {c |}{res}      3,315       20.54       20.54
{txt}        Lofa {c |}{res}      6,317       39.15       59.69
{txt}       Nimba {c |}{res}      6,504       40.31      100.00
{txt}{hline 13}{c +}{hline 35}
       Total {c |}{res}     16,136      100.00
{txt}
{com}. gen commcode_adj=commcode
{txt}(1 missing value generated)

{com}.         la var commcode_adj "Adjusted commcode"
{txt}
{com}. replace commcode_adj=1001 if commcount_et==1 & county1==1               // 5 changes made
{txt}(6 real changes made)

{com}. replace commcode_adj=1002 if commcount_et==1 & county2==1               // 2 changes made
{txt}(2 real changes made)

{com}. replace commcode_adj=1003 if commcount_et==1 & county3==1               // 7 changes made
{txt}(7 real changes made)

{com}. 
. * Control variable for if in community w/ other quarter assigned to treatment blocks 1-4
. 
. gen quartdummy=cond(commcode==3011 | commcode==2041 | commcode==1082 | commcode==2112 | commcode==3291 | commcode==2431 | commcode==2430 | commcode==1312 | commcode==1321 | commcode==2612 | commcode==2902 | commcode==1472 |commcode==1473,1,0)
{txt}
{com}.         la var quartdummy "Treatment: Control quater in community with other quarter assigned to treatment blocks 1-4"
{txt}note: label truncated to 80 characters

{com}. 
. 
. ********************************************************************************
. * Construct variables related to leader attitudes, norms, and skills ***********
. ********************************************************************************
. ********************************************************************************
. * Fix all the norms and skills variables for the leaders  **********************
. ********************************************************************************
. 
. /*      The following categories are deprecated, but are still useful because I don't
>         want to rewrite the de-stringing code. 
> 
>         Additionally, notice that this next section renames the variables ending in 
>         _el2 to get rid of the suffix. Then it adds the suffix again. Don't ask me
>         why it was written this way. But it works and i don't want to add the 
>         suffix to this code manually. 
> */
. 
. /*      Rename skbringtogehter to skbringtogether. Not sure why this wasn't caught
>         earlier. 
> */
. rename skbringtogehter* skbringtogether*
{res}{txt}
{com}. 
. 
. * Destring the norms and skills variables **************************************
. local att_neg   "nospoilpropop nocompromop nogiftop"
{txt}
{com}. local norm_neg  "nospoilpropco nocompromco nogiftco"
{txt}
{com}. local att_bias  "nogossipop nosmalllieop notakesideop"
{txt}
{com}. local norm_bias "nogossipco nosmalllieco notakesideco"
{txt}
{com}. local att_med   "noadviseop nomediateop nohelpcompop"
{txt}
{com}. local norm_med  "noadviseco nomediateco nohelpcompco"
{txt}
{com}. local att_def   "norenegeop nochiefsupportop nopoliceop nocontactsop"
{txt}
{com}. local norm_def  "norenegeco nochiefsupportco nopoliceco nocontactsco"
{txt}
{com}. local att_cho   "notalkfirstop nocommfirstop nopolicefirstop"
{txt}
{com}. local norm_cho  "notalkfirstco nocommfirstco nopolicefirstco"
{txt}
{com}. 
. local skill_com "sklisten skconvincetalk sktalkpalava sktalkbad"
{txt}
{com}. local skill_emp "skempathy skthinkwrong skthinkshoes"
{txt}
{com}. local skill_emo "skstaycalm skcooltemper skcooltemperothers"
{txt}
{com}. local skill_neg "sktalkgood skproposesolution skcompromise skforgive"
{txt}
{com}. local skill_med "skbringtogether skhelpagree skhelpunderstand"
{txt}
{com}. 
. foreach sub in att_neg norm_neg att_bias norm_bias att_med norm_med att_def norm_def att_cho norm_cho skill_com skill_emp skill_emo skill_neg skill_med {c -(}
{txt}  2{com}.         foreach x in ``sub'' {c -(}
{txt}  3{com}.                 // do the weird renaming thing. 
.                 ren `x'_el2 `x'
{txt}  4{com}.         {c )-}
{txt}  5{com}. {c )-}
{res}{txt}
{com}. 
. foreach sub in att_neg norm_neg att_bias norm_bias att_med norm_med att_def norm_def att_cho norm_cho skill_com skill_emp skill_emo skill_neg skill_med {c -(}
{txt}  2{com}.         foreach x in ``sub'' {c -(}
{txt}  3{com}.                 local lab : var label `x'
{txt}  4{com}.                 split `x', p("-")
{txt}  5{com}.                 destring `x'1, replace force
{txt}  6{com}.                         la var `x'1 "`lab'"
{txt}  7{com}.                 drop `x'2
{txt}  8{com}.                 drop `x'
{txt}  9{com}.                 rename `x'1 `x'
{txt} 10{com}.         {c )-}
{txt} 11{com}. {c )-}
{res}variables created as string: 
{txt}{col 1}nospoilpro~1{col 15}nospoilpr~p2
nospoilpropop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}nocompromop1{col 15}nocompromop2
nocompromop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}nogiftop1{col 12}nogiftop2
nogiftop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}nospoilpro~1{col 15}nospoilpr~o2
nospoilpropco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15188 missing values generated)
{res}variables created as string: 
{txt}{col 1}nocompromco1{col 15}nocompromco2
nocompromco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15171 missing values generated)
{res}variables created as string: 
{txt}{col 1}nogiftco1{col 12}nogiftco2
nogiftco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15180 missing values generated)
{res}variables created as string: 
{txt}{col 1}nogossipop1{col 14}nogossipop2
nogossipop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}nosmalllie~1{col 15}nosmallli~p2
nosmalllieop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}notakeside~1{col 15}notakesid~p2
notakesideop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}nogossipco1{col 14}nogossipco2
nogossipco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15200 missing values generated)
{res}variables created as string: 
{txt}{col 1}nosmalllie~1{col 15}nosmallli~o2
nosmalllieco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15191 missing values generated)
{res}variables created as string: 
{txt}{col 1}notakeside~1{col 15}notakesid~o2
notakesideco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15184 missing values generated)
{res}variables created as string: 
{txt}{col 1}noadviseop1{col 14}noadviseop2
noadviseop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}nomediateop1{col 15}nomediateop2
nomediateop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}nohelpcomp~1{col 15}nohelpcom~p2
nohelpcompop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}noadviseco1{col 14}noadviseco2
noadviseco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15169 missing values generated)
{res}variables created as string: 
{txt}{col 1}nomediateco1{col 15}nomediateco2
nomediateco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15168 missing values generated)
{res}variables created as string: 
{txt}{col 1}nohelpcomp~1{col 15}nohelpcom~o2
nohelpcompco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15169 missing values generated)
{res}variables created as string: 
{txt}{col 1}norenegeop1{col 14}norenegeop2
norenegeop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}nochiefsup~1{col 15}nochiefsu~p2
nochiefsupportop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}nopoliceop1{col 14}nopoliceop2
nopoliceop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}nocontacts~1{col 15}nocontact~p2
nocontactsop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}norenegeco1{col 14}norenegeco2
norenegeco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15176 missing values generated)
{res}variables created as string: 
{txt}{col 1}nochiefsup~1{col 15}nochiefsu~o2
nochiefsupportco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15183 missing values generated)
{res}variables created as string: 
{txt}{col 1}nopoliceco1{col 14}nopoliceco2
nopoliceco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15175 missing values generated)
{res}variables created as string: 
{txt}{col 1}nocontacts~1{col 15}nocontact~o2
nocontactsco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15189 missing values generated)
{res}variables created as string: 
{txt}{col 1}notalkfirs~1{col 15}notalkfir~p2
notalkfirstop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}nocommfirs~1{col 15}nocommfir~p2
nocommfirstop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}nopolicefi~1{col 15}nopolicef~p2
nopolicefirstop1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}notalkfirs~1{col 15}notalkfir~o2
notalkfirstco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15176 missing values generated)
{res}variables created as string: 
{txt}{col 1}nocommfirs~1{col 15}nocommfir~o2
nocommfirstco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15170 missing values generated)
{res}variables created as string: 
{txt}{col 1}nopolicefi~1{col 15}nopolicef~o2
nopolicefirstco1: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(15181 missing values generated)
{res}variables created as string: 
{txt}{col 1}sklisten1{col 12}sklisten2
sklisten1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skconvince~1{col 15}skconvinc~k2
skconvincetalk1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}sktalkpala~1{col 15}sktalkpal~a2
sktalkpalava1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}sktalkbad1{col 13}sktalkbad2
sktalkbad1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skempathy1{col 13}skempathy2
skempathy1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skthinkwro~1{col 15}skthinkwr~g2
skthinkwrong1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skthinksho~1{col 15}skthinksh~s2
skthinkshoes1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skstaycalm1{col 14}skstaycalm2
skstaycalm1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skcooltemp~1{col 15}skcooltem~r2
skcooltemper1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skcooltemp~1{col 15}skcooltem~s2
skcooltemperothers1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}sktalkgood1{col 14}sktalkgood2
sktalkgood1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skproposes~1{col 15}skpropose~n2
skproposesolution1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skcompromi~1{col 15}skcomprom~e2
skcompromise1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skforgive1{col 13}skforgive2
skforgive1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skbringtog~1{col 15}skbringto~r2
skbringtogether1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skhelpagree1{col 15}skhelpagree2
skhelpagree1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}variables created as string: 
{txt}{col 1}skhelpunde~1{col 15}skhelpund~d2
skhelpunderstand1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}(15166 missing values generated)
{res}{txt}
{com}. 
. * Make standardized forms of each variable *************************************
. foreach sub in att_neg att_bias att_med att_def att_cho {c -(}
{txt}  2{com}.         local `sub'_st
{txt}  3{com}.         foreach x in ``sub'' {c -(}
{txt}  4{com}.                 loc lab: var label `x'
{txt}  5{com}.                 egen `x'_st=std(`x')
{txt}  6{com}.                         la var `x'_st "`lab', z-score"
{txt}  7{com}.                 local `sub'_st ``sub'_st' `x'_st
{txt}  8{com}.         {c )-}
{txt}  9{com}.         display "``sub'_st'"
{txt} 10{com}. {c )-}
{txt}(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
nospoilpropop_st nocompromop_st nogiftop_st
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
nogossipop_st nosmalllieop_st notakesideop_st
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
noadviseop_st nomediateop_st nohelpcompop_st
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
norenegeop_st nochiefsupportop_st nopoliceop_st nocontactsop_st
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
notalkfirstop_st nocommfirstop_st nopolicefirstop_st

{com}. 
. foreach sub in norm_neg norm_bias norm_med norm_def norm_cho {c -(}
{txt}  2{com}.         local `sub'_st
{txt}  3{com}.         foreach x in ``sub'' {c -(}
{txt}  4{com}.                 loc lab: var label `x'
{txt}  5{com}.                 egen `x'_st=std(`x')
{txt}  6{com}.                         la var `x'_st "`lab', z-score"
{txt}  7{com}.                 local `sub'_st ``sub'_st' `x'_st
{txt}  8{com}.         {c )-}
{txt}  9{com}.         display "``sub'_st'"
{txt} 10{com}. {c )-}
{txt}(15188 missing values generated)
note: label truncated to 80 characters
(15171 missing values generated)
note: label truncated to 80 characters
(15180 missing values generated)
note: label truncated to 80 characters
nospoilpropco_st nocompromco_st nogiftco_st
(15200 missing values generated)
note: label truncated to 80 characters
(15191 missing values generated)
(15184 missing values generated)
note: label truncated to 80 characters
nogossipco_st nosmalllieco_st notakesideco_st
(15169 missing values generated)
note: label truncated to 80 characters
(15168 missing values generated)
note: label truncated to 80 characters
(15169 missing values generated)
note: label truncated to 80 characters
noadviseco_st nomediateco_st nohelpcompco_st
(15176 missing values generated)
note: label truncated to 80 characters
(15183 missing values generated)
note: label truncated to 80 characters
(15175 missing values generated)
note: label truncated to 80 characters
(15189 missing values generated)
note: label truncated to 80 characters
norenegeco_st nochiefsupportco_st nopoliceco_st nocontactsco_st
(15176 missing values generated)
note: label truncated to 80 characters
(15170 missing values generated)
note: label truncated to 80 characters
(15181 missing values generated)
note: label truncated to 80 characters
notalkfirstco_st nocommfirstco_st nopolicefirstco_st

{com}. 
. foreach sub in skill_com skill_emp skill_emo skill_neg skill_med {c -(}
{txt}  2{com}.         local `sub'_st
{txt}  3{com}.         foreach x in ``sub'' {c -(}
{txt}  4{com}.                 loc lab: var label `x'
{txt}  5{com}.                 egen `x'_st=std(`x')
{txt}  6{com}.                         la var `x'_st "`lab', z-score"
{txt}  7{com}.                 local `sub'_st ``sub'_st' `x'_st
{txt}  8{com}.         {c )-}
{txt}  9{com}.         display "``sub'_st'"
{txt} 10{com}. {c )-}
{txt}(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
sklisten_st skconvincetalk_st sktalkpalava_st sktalkbad_st
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
skempathy_st skthinkwrong_st skthinkshoes_st
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
skstaycalm_st skcooltemper_st skcooltemperothers_st
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
sktalkgood_st skproposesolution_st skcompromise_st skforgive_st
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
(15166 missing values generated)
note: label truncated to 80 characters
skbringtogether_st skhelpagree_st skhelpunderstand_st

{com}. 
. 
. foreach sub in att_neg norm_neg att_bias norm_bias att_med norm_med att_def norm_def att_cho norm_cho skill_com skill_emp skill_emo skill_neg skill_med {c -(}
{txt}  2{com}.         foreach x in ``sub'' {c -(}
{txt}  3{com}.                 ren `x' `x'_el2
{txt}  4{com}.                 ren `x'_st `x'_st_el2
{txt}  5{com}.         {c )-}
{txt}  6{com}. {c )-}
{res}{txt}
{com}. 
. 
. 
. 
. * Make sure all variables point in the same direction **************************
. /*      All the resident-level norms, attitudes, and skills variables are changed
>         to point in the same direction further upstream. Now we just have to do it 
>         for the leaders. 
> */
. 
. * skills ***********************************************************************
. * make sure things point in the right direction 
. foreach x in sklisten_el2 skconvincetalk_el2 skempathy_el2 skthinkwrong_el2 skthinkshoes_el2 ///
> sktalkpalava_el2 skstaycalm_el2 skcooltemper_el2 sktalkgood_el2 skproposesolution_el2 skcompromise_el2 ///
> skforgive_el2 skbringtogether_el2 skhelpagree_el2 skhelpunderstand_el2 skcooltemperothers_el2 {c -(}
{txt}  2{com}.         replace `x'=5-`x'
{txt}  3{com}. {c )-}
{txt}(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)

{com}. 
. * attitudes ********************************************************************
. * make sure that a bigger number is more consistent with ADR
. foreach x in nocompromop_el2 nogiftop_el2 noadviseop_el2 notalkfirstop_el2 nocommfirstop_el2 ///
>         nomediateop_el2 nohelpcompop_el2 nopoliceop_el2 nopolicefirstop_el2 {c -(}
{txt}  2{com}.         replace `x'=5-`x'
{txt}  3{com}. {c )-}
{txt}(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)

{com}. 
. 
. * norms ************************************************************************
. * make sure that a bigger number is more consistent with ADR
. foreach x in nospoilpropco_el2 nogossipco_el2 nosmalllieco_el2 norenegeco_el2 nochiefsupportco_el2 nopoliceco_el2 nocontactsco_el2 nopolicefirstco_el2 notakesideco_el2 {c -(}
{txt}  2{com}.         replace `x'=7-`x'
{txt}  3{com}. {c )-}
{txt}(949 real changes made)
(937 real changes made)
(946 real changes made)
(961 real changes made)
(954 real changes made)
(962 real changes made)
(948 real changes made)
(956 real changes made)
(953 real changes made)

{com}. 
. /*
> 
> TODO: Deprecate this set of norms. We are now interested in "themes" of 
> attitudes, skills, and norms, not any of them separately. 
> 
> */
. 
. ********************************************************************************
. * Define a program for making indices ******************************************
. ********************************************************************************
. /* Is this really so hard? */
. cap program drop make_index 
{txt}
{com}. program define make_index 
{txt}  1{com}.         syntax varlist, INDEXNAME(name)
{txt}  2{com}. 
.         cap drop Z* 
{txt}  3{com}. 
.         foreach sub_var in `varlist' {c -(}
{txt}  4{com}.                 cap drop Z_`sub_var'
{txt}  5{com}. 
. 
.                 sum `sub_var' if ENDLINE2_RESIDENT == 1
{txt}  6{com}.                 replace `sub_var' = r(p50) if missing(`sub_var') & ENDLINE2_RESIDENT == 1
{txt}  7{com}.                 egen Z_`sub_var' = std(`sub_var') 
{txt}  8{com}.         {c )-}
{txt}  9{com}. 
.         egen `indexname' = rowtotal(Z_*), m 
{txt} 10{com}.         sum `indexname', detail 
{txt} 11{com}.         replace `indexname' = (`indexname' - r(mean)) / r(sd)
{txt} 12{com}. 
.         drop Z_* 
{txt} 13{com}.         
. end
{txt}
{com}. 
. 
. ********************************************************************************
. * Make the indices for the Residents *******************************************
. ********************************************************************************
. 
. * Impute medians ***************************************************************
. foreach sub in att_neg norm_neg att_bias norm_bias att_med norm_med att_def norm_def att_cho norm_cho skill_com skill_emp skill_emo skill_neg skill_med {c -(}
{txt}  2{com}.         sum `sub'_st_ec2 
{txt}  3{com}.         replace `sub'_st_ec2 = r(p50) if missing(`sub'_st_ec2) & ENDLINE2_RESIDENT
{txt}  4{com}. {c )-}

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
att_neg_st~2 {c |}{res}      4,012   -.0036845    1.001064  -5.128102   1.516328
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
norm_neg_s~2 {c |}{res}      3,906   -.0100259    .9968939   -3.41974   2.009643
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
att_bias_s~2 {c |}{res}      4,012    .0027187     1.00071  -5.451293   1.364021
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
norm_b~t_ec2 {c |}{res}      3,825   -.0044854    .9992954  -3.094975   1.418209
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
att_med_st~2 {c |}{res}      4,012    .0031379    .9958459    -5.8044   1.168857
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
norm_med_s~2 {c |}{res}      3,960   -.0059187    .9978179  -2.545469   1.787188
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
att_def_st~2 {c |}{res}      4,012    .0009654    1.001686  -4.448176   2.694305
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
norm_def_s~2 {c |}{res}      3,862    -.005107     1.00095  -3.837591   1.606638
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
att_cho_st~2 {c |}{res}      4,012     .001744    1.003241  -5.372997   3.714554
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
norm_cho_s~2 {c |}{res}      3,927   -.0049804    .9990637  -3.245107   2.014288
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
ski~m_st_ec2 {c |}{res}      4,011   -.0023112    1.001876  -2.850946   1.939673
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
ski~p_st_ec2 {c |}{res}      4,011   -.0061333    1.000111  -1.615344   2.069679
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
ski~o_st_ec2 {c |}{res}      4,011   -.0042638    1.002242  -2.201612   1.766146
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
ski~g_st_ec2 {c |}{res}      4,011   -.0082102    1.001426  -1.784816   1.958524
{txt}(0 real changes made)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
ski~d_st_ec2 {c |}{res}      4,011   -.0010595    1.001419  -2.243392   1.379257
{txt}(0 real changes made)

{com}. 
. local bias_index_vars nogossipop_ec2 nogossipco_ec2 nosmalllieop_ec2 ///
>         nosmalllieco_ec2 notakesideop_ec2 notakesideco_ec2
{txt}
{com}. make_index `bias_index_vars', indexname(bias_index_ec2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nogoss~p_ec2 {c |}{res}      4,012    3.452642    .5640263          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nogoss~o_ec2 {c |}{res}      3,721     4.31255    1.535556          1          6
{txt}(0 real changes made)
(12416 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nosmal~p_ec2 {c |}{res}      4,012    3.351944    .5764978          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nosmal~o_ec2 {c |}{res}      3,718    4.346692    1.367413          1          6
{txt}(0 real changes made)
(12419 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
notake~p_ec2 {c |}{res}      4,012     3.39656    .6224569          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
notake~o_ec2 {c |}{res}      3,834    4.603026    1.323473          1          6
{txt}(0 real changes made)
(12303 missing values generated)
(12125 missing values generated)

                       bias_index_ec2
{hline 61}
      Percentiles      Smallest
 1%    {res}-7.970374      -18.22289
{txt} 5%    {res}-5.632529      -14.08779
{txt}10%    {res}-4.321072      -13.19512       {txt}Obs         {res}      4,012
{txt}25%    {res} -2.12495      -12.35318       {txt}Sum of Wgt. {res}      4,012

{txt}50%    {res}-.0691003                      {txt}Mean          {res} 5.05e-08
                        {txt}Largest       Std. Dev.     {res} 3.326853
{txt}75%    {res} 2.335737       6.427554
{txt}90%    {res} 4.289427       6.427554       {txt}Variance      {res} 11.06795
{txt}95%    {res} 5.671966       6.427554       {txt}Skewness      {res}-.2175033
{txt}99%    {res} 6.427554       6.427554       {txt}Kurtosis      {res} 3.070186
{txt}(4,012 real changes made)

{com}. 
. local defection_index_vars norenegeop_ec2 norenegeco_ec2 nochiefsupportop_ec2 ///
>         nochiefsupportco_ec2 nopoliceop_ec2 nopoliceco_ec2 nocontactsop_ec2 nocontactsco_ec2 
{txt}
{com}. make_index `defection_index_vars', indexname(defection_index_ec2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
norene~p_ec2 {c |}{res}      4,012    3.272931    .5975393          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
norene~o_ec2 {c |}{res}      3,718    4.724583     1.23115          1          6
{txt}(0 real changes made)
(12419 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nochie~p_ec2 {c |}{res}      4,012    2.807079    .8629148          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nochie~o_ec2 {c |}{res}      3,707    4.311573    1.524502          1          6
{txt}(0 real changes made)
(12430 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nopo~eop_ec2 {c |}{res}      4,012     2.38335    .9573825          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nopo~eco_ec2 {c |}{res}      3,847    4.276839    1.538395          1          6
{txt}(0 real changes made)
(12290 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nocont~p_ec2 {c |}{res}      4,012    3.098455    .6813596          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nocont~o_ec2 {c |}{res}      3,694    4.692474    1.286966          1          6
{txt}(0 real changes made)
(12443 missing values generated)
(12125 missing values generated)

                     defection_index_ec2
{hline 61}
      Percentiles      Smallest
 1%    {res} -9.35789      -15.24565
{txt} 5%    {res}-6.568698      -14.02334
{txt}10%    {res}-4.893118      -13.55881       {txt}Obs         {res}      4,012
{txt}25%    {res}-2.162047       -13.4946       {txt}Sum of Wgt. {res}      4,012

{txt}50%    {res} .3443671                      {txt}Mean          {res} 6.20e-08
                        {txt}Largest       Std. Dev.     {res} 3.604324
{txt}75%    {res} 2.462973       9.890536
{txt}90%    {res} 4.290341       9.890536       {txt}Variance      {res} 12.99115
{txt}95%    {res} 5.562209       9.890536       {txt}Skewness      {res}-.4365401
{txt}99%    {res}  7.06567       9.890536       {txt}Kurtosis      {res} 3.305085
{txt}(4,012 real changes made)

{com}. 
. local empathy_index_vars sklisten_ec2 skconvincetalk_ec2 skempathy_ec2 skthinkwrong_ec2 ///
>         skthinkshoes_ec2
{txt}
{com}. make_index `empathy_index_vars', indexname(empathy_index_ec2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
sklisten_ec2 {c |}{res}      4,011    2.457492    1.048631          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skconv~k_ec2 {c |}{res}      4,011    2.572924    1.059975          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skempa~y_ec2 {c |}{res}      4,011    2.455497    1.003088          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skthin~g_ec2 {c |}{res}      4,011     2.28347    1.000336          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skthin~s_ec2 {c |}{res}      4,011    2.194465    .9729915          1          4
{txt}(0 real changes made)
(12126 missing values generated)
(12126 missing values generated)

                      empathy_index_ec2
{hline 61}
      Percentiles      Smallest
 1%    {res}-6.835504      -6.835504
{txt} 5%    {res}-6.835504      -6.835504
{txt}10%    {res}-6.835504      -6.835504       {txt}Obs         {res}      4,011
{txt}25%    {res}-1.960156      -6.835504       {txt}Sum of Wgt. {res}      4,011

{txt}50%    {res} .1003571                      {txt}Mean          {res} 7.81e-08
                        {txt}Largest       Std. Dev.     {res} 3.800723
{txt}75%    {res} 2.907728       7.928658
{txt}90%    {res} 4.929665       7.928658       {txt}Variance      {res} 14.44549
{txt}95%    {res} 5.947275       7.928658       {txt}Skewness      {res}-.2485909
{txt}99%    {res} 7.928658       7.928658       {txt}Kurtosis      {res} 2.457897
{txt}(4,011 real changes made)

{com}. 
. local forum_choice_index_vars notalkfirstop_ec2 notalkfirstco_ec2  ///
>         nocommfirstop_ec2 nocommfirstco_ec2 nopolicefirstop_ec2 nopolicefirstco_ec2
{txt}
{com}. make_index `forum_choice_index_vars',indexname(forum_choice_index_ec2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
notalk~p_ec2 {c |}{res}      4,012    3.228315    .6974083          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
notalk~o_ec2 {c |}{res}      3,851    3.280966    1.476218          1          6
{txt}(0 real changes made)
(12286 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nocomm~p_ec2 {c |}{res}      4,012    3.440927    .6014608          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nocomm~o_ec2 {c |}{res}      3,927    4.219506    1.460011          1          6
{txt}(0 real changes made)
(12210 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nopo~top_ec2 {c |}{res}      4,012    1.619392    .6563294          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nopo~tco_ec2 {c |}{res}      3,825    4.959739    1.244843          1          6
{txt}(0 real changes made)
(12312 missing values generated)
(12125 missing values generated)

                   forum_choice_index_ec2
{hline 61}
      Percentiles      Smallest
 1%    {res}-6.120961       -11.1118
{txt} 5%    {res}-4.178486      -10.10463
{txt}10%    {res}-3.064895      -9.796306       {txt}Obs         {res}      4,012
{txt}25%    {res}-1.627596       -9.00692       {txt}Sum of Wgt. {res}      4,012

{txt}50%    {res} .0219367                      {txt}Mean          {res}-2.08e-08
                        {txt}Largest       Std. Dev.     {res} 2.515454
{txt}75%    {res}  1.59481       7.323045
{txt}90%    {res}  3.41649       7.394592       {txt}Variance      {res} 6.327507
{txt}95%    {res}  4.18605       7.402112       {txt}Skewness      {res}-.1342018
{txt}99%    {res} 5.158175        9.56024       {txt}Kurtosis      {res} 3.116889
{txt}(4,012 real changes made)

{com}. 
. local managing_emotions_index_vars nospoilpropop_ec2 nospoilpropco_ec2 skstaycalm_ec2 skcooltemper_ec2 ///
>         sktalkbad_ec2
{txt}
{com}. make_index `managing_emotions_index_vars', indexname(managing_emotions_index_ec2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nospoi~p_ec2 {c |}{res}      4,012    3.375374    .5917843          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nospoi~o_ec2 {c |}{res}      3,761    5.306036    1.035892          1          6
{txt}(0 real changes made)
(12376 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skstay~m_ec2 {c |}{res}      4,011    2.511593    .9915115          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skcool~r_ec2 {c |}{res}      4,011    2.630017    1.000367          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
sktal~ad_ec2 {c |}{res}      4,011    3.326103    .8590804          1          4
{txt}(0 real changes made)
(12126 missing values generated)
(12125 missing values generated)

                 managing_emotions_index_ec2
{hline 61}
      Percentiles      Smallest
 1%    {res}-6.679355      -11.37722
{txt} 5%    {res} -3.93752      -11.13632
{txt}10%    {res}-3.003822      -10.04134       {txt}Obs         {res}      4,012
{txt}25%    {res}-1.609449      -9.851585       {txt}Sum of Wgt. {res}      4,012

{txt}50%    {res} .0356584                      {txt}Mean          {res}-2.90e-08
                        {txt}Largest       Std. Dev.     {res} 2.510518
{txt}75%    {res} 1.682485       5.380484
{txt}90%    {res} 3.372291       5.380484       {txt}Variance      {res} 6.302701
{txt}95%    {res} 3.702004       5.380484       {txt}Skewness      {res}-.3159152
{txt}99%    {res} 5.380484       5.380484       {txt}Kurtosis      {res} 3.345837
{txt}(4,012 real changes made)

{com}. 
. 
. local mediation_index_vars noadviseop_ec2 noadviseco_ec2 nomediateop_ec2 nomediateco_ec2 ///
>         nohelpcompop_ec2 nohelpcompco_ec2 skbringtogether_ec2 skhelpagree_ec2 ///
>         skhelpunderstand_ec2 skcooltemperothers_ec2 
{txt}
{com}. make_index `mediation_index_vars', indexname(mediation_index_ec2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
noadvi~p_ec2 {c |}{res}      4,012    3.470837    .5648183          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
noadvi~o_ec2 {c |}{res}      3,928    3.900967    1.457179          1          6
{txt}(0 real changes made)
(12209 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nomedi~p_ec2 {c |}{res}      4,012    3.543121    .5283157          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nomedi~o_ec2 {c |}{res}      3,950     4.00557    1.440636          1          6
{txt}(0 real changes made)
(12187 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nohelp~p_ec2 {c |}{res}      4,012     3.48006    .5187592          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nohelp~o_ec2 {c |}{res}      3,954     3.88265    1.397438          1          6
{txt}(0 real changes made)
(12183 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skbrin~r_ec2 {c |}{res}      4,011    2.879083    .9758116          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skhelp~e_ec2 {c |}{res}      4,011    2.803042    .9406851          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skhelp~d_ec2 {c |}{res}      4,011    2.889055    .9301851          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skcool~s_ec2 {c |}{res}      4,011    2.838694    .9730322          1          4
{txt}(0 real changes made)
(12126 missing values generated)
(12125 missing values generated)

                     mediation_index_ec2
{hline 61}
      Percentiles      Smallest
 1%    {res}-11.98542      -26.44056
{txt} 5%    {res}-8.679993      -22.13599
{txt}10%    {res}-6.897491      -21.86698       {txt}Obs         {res}      4,012
{txt}25%    {res}-3.738969      -20.21797       {txt}Sum of Wgt. {res}      4,012

{txt}50%    {res} .1029215                      {txt}Mean          {res}-1.09e-08
                        {txt}Largest       Std. Dev.     {res} 5.224294
{txt}75%    {res} 3.596715       11.95294
{txt}90%    {res} 6.681667       11.95294       {txt}Variance      {res} 27.29325
{txt}95%    {res} 8.527922       11.95294       {txt}Skewness      {res} -.176314
{txt}99%    {res} 10.92522       11.95294       {txt}Kurtosis      {res} 2.909731
{txt}(4,012 real changes made)

{com}. 
. 
. local negotiation_index_vars nocompromop_ec2 nocompromco_ec2 nogiftop_ec2 nogiftco_ec2 ///
>         sktalkpalava_ec2 sktalkgood_ec2 skproposesolution_ec2 skcompromise_ec2 ///
>         skforgive_ec2
{txt}
{com}. make_index `negotiation_index_vars', indexname(negotiation_index_ec2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nocomp~p_ec2 {c |}{res}      4,012    3.424975    .5680818          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nocomp~o_ec2 {c |}{res}      3,920    3.744133    1.527027          1          6
{txt}(0 real changes made)
(12217 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nogiftop_ec2 {c |}{res}      4,012    3.085743     .761925          1          4
{txt}(0 real changes made)
(12125 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nogiftco_ec2 {c |}{res}      3,821    3.140801    1.586284          1          6
{txt}(0 real changes made)
(12316 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
sktalk~a_ec2 {c |}{res}      4,011    2.653702    1.103609          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
sktal~od_ec2 {c |}{res}      4,011    2.569434     1.00639          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skprop~n_ec2 {c |}{res}      4,011    2.405136    .9640229          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skcomp~e_ec2 {c |}{res}      4,011     2.53079    1.010043          1          4
{txt}(0 real changes made)
(12126 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skforg~e_ec2 {c |}{res}      4,011    2.189479    1.010666          1          4
{txt}(0 real changes made)
(12126 missing values generated)
(12125 missing values generated)

                    negotiation_index_ec2
{hline 61}
      Percentiles      Smallest
 1%    {res}-10.52325      -17.36077
{txt} 5%    {res}-8.169642      -16.32346
{txt}10%    {res}-6.413928      -14.08098       {txt}Obs         {res}      4,012
{txt}25%    {res}-3.300183       -13.4342       {txt}Sum of Wgt. {res}      4,012

{txt}50%    {res} .1081298                      {txt}Mean          {res}-5.14e-08
                        {txt}Largest       Std. Dev.     {res} 4.853868
{txt}75%    {res} 3.311804       12.40328
{txt}90%    {res} 6.505797       13.03368       {txt}Variance      {res} 23.56004
{txt}95%    {res} 8.096981       13.03368       {txt}Skewness      {res}  -.03645
{txt}99%    {res} 10.46314       13.03368       {txt}Kurtosis      {res} 2.625964
{txt}(4,012 real changes made)

{com}. 
. ********************************************************************************
. * Make the indices for the Residents *******************************************
. ********************************************************************************
. 
. local bias_index_vars nogossipop_el2 nogossipco_el2 nosmalllieop_el2 ///
>         nosmalllieco_el2 notakesideop_el2 notakesideco_el2
{txt}
{com}. make_index `bias_index_vars', indexname(bias_index_el2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nogoss~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nogoss~o_el2 {c |}{res}          0
{txt}(0 real changes made)
(15200 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nosmal~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nosmal~o_el2 {c |}{res}          0
{txt}(0 real changes made)
(15191 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
notake~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
notake~o_el2 {c |}{res}          0
{txt}(0 real changes made)
(15184 missing values generated)
(15166 missing values generated)

                       bias_index_el2
{hline 61}
      Percentiles      Smallest
 1%    {res}-8.877837      -10.20291
{txt} 5%    {res}-6.206319      -10.20291
{txt}10%    {res}-4.621171       -9.81081       {txt}Obs         {res}        971
{txt}25%    {res}-1.906355      -9.722639       {txt}Sum of Wgt. {res}        971

{txt}50%    {res}-.0839916                      {txt}Mean          {res}-4.28e-08
                        {txt}Largest       Std. Dev.     {res} 3.470742
{txt}75%    {res} 2.000986       7.024066
{txt}90%    {res} 4.703889       7.024066       {txt}Variance      {res} 12.04605
{txt}95%    {res}  6.18586       7.024066       {txt}Skewness      {res}-.1291193
{txt}99%    {res} 7.024066       7.024066       {txt}Kurtosis      {res} 2.911351
{txt}(971 real changes made)

{com}. 
. local defection_index_vars norenegeop_el2 norenegeco_el2 nochiefsupportop_el2 ///
>         nochiefsupportco_el2 nopoliceop_el2 nopoliceco_el2 nocontactsop_el2 nocontactsco_el2 
{txt}
{com}. make_index `defection_index_vars', indexname(defection_index_el2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
norene~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
norene~o_el2 {c |}{res}          0
{txt}(0 real changes made)
(15176 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nochie~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nochie~o_el2 {c |}{res}          0
{txt}(0 real changes made)
(15183 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nopo~eop_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nopo~eco_el2 {c |}{res}          0
{txt}(0 real changes made)
(15175 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nocont~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nocont~o_el2 {c |}{res}          0
{txt}(0 real changes made)
(15189 missing values generated)
(15166 missing values generated)

                     defection_index_el2
{hline 61}
      Percentiles      Smallest
 1%    {res} -9.02678      -11.58099
{txt} 5%    {res}-6.495785      -11.32884
{txt}10%    {res}-5.117855      -11.20784       {txt}Obs         {res}        971
{txt}25%    {res}-2.605413      -10.21062       {txt}Sum of Wgt. {res}        971

{txt}50%    {res} .2488075                      {txt}Mean          {res} 2.70e-08
                        {txt}Largest       Std. Dev.     {res} 3.761339
{txt}75%    {res} 2.865868        9.36113
{txt}90%    {res} 4.719668       9.872487       {txt}Variance      {res} 14.14767
{txt}95%    {res} 5.624237       9.872487       {txt}Skewness      {res}-.2272853
{txt}99%    {res} 7.752765       10.54497       {txt}Kurtosis      {res} 2.721063
{txt}(971 real changes made)

{com}. 
. local empathy_index_vars sklisten_el2 skconvincetalk_el2 skempathy_el2 skthinkwrong_el2 ///
>         skthinkshoes_el2
{txt}
{com}. make_index `empathy_index_vars', indexname(empathy_index_el2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
sklisten_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skconv~k_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skempa~y_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skthin~g_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skthin~s_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)
(15166 missing values generated)

                      empathy_index_el2
{hline 61}
      Percentiles      Smallest
 1%    {res} -7.62938       -7.62938
{txt} 5%    {res} -7.62938       -7.62938
{txt}10%    {res} -6.72119       -7.62938       {txt}Obs         {res}        971
{txt}25%    {res}-2.070057       -7.62938       {txt}Sum of Wgt. {res}        971

{txt}50%    {res} .1392007                      {txt}Mean          {res}-2.58e-09
                        {txt}Largest       Std. Dev.     {res} 3.882186
{txt}75%    {res} 2.844012       6.867019
{txt}90%    {res} 4.855515       6.867019       {txt}Variance      {res} 15.07137
{txt}95%    {res} 6.867019       6.867019       {txt}Skewness      {res}-.3652155
{txt}99%    {res} 6.867019       6.867019       {txt}Kurtosis      {res} 2.581045
{txt}(971 real changes made)

{com}. 
. local forum_choice_index_vars notalkfirstop_el2 notalkfirstco_el2 notalkfirstop_el2 ///
>         nocommfirstop_el2 nocommfirstco_el2 nopolicefirstco_el2
{txt}
{com}. make_index `forum_choice_index_vars',indexname(forum_choice_index_el2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
notalk~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
notalk~o_el2 {c |}{res}          0
{txt}(0 real changes made)
(15176 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
notalk~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nocomm~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nocomm~o_el2 {c |}{res}          0
{txt}(0 real changes made)
(15170 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nopo~tco_el2 {c |}{res}          0
{txt}(0 real changes made)
(15181 missing values generated)
(15166 missing values generated)

                   forum_choice_index_el2
{hline 61}
      Percentiles      Smallest
 1%    {res}-6.740363      -9.770152
{txt} 5%    {res}-4.568173      -8.598447
{txt}10%    {res}-3.688019      -7.907467       {txt}Obs         {res}        971
{txt}25%    {res}-1.865498      -7.718208       {txt}Sum of Wgt. {res}        971

{txt}50%    {res} .1560769                      {txt}Mean          {res}-4.68e-08
                        {txt}Largest       Std. Dev.     {res} 2.721835
{txt}75%    {res} 1.947211       5.561426
{txt}90%    {res} 3.389321       5.561426       {txt}Variance      {res} 7.408387
{txt}95%    {res} 4.240542       5.561426       {txt}Skewness      {res}-.2491557
{txt}99%    {res} 5.561426       5.561426       {txt}Kurtosis      {res} 2.874513
{txt}(971 real changes made)

{com}. 
. local managing_emotions_index_vars nospoilpropop_el2 nospoilpropop_el2 skstaycalm_el2 skcooltemper_el2 ///
>         sktalkbad_el2
{txt}
{com}. make_index `managing_emotions_index_vars', indexname(managing_emotions_index_el2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nospoi~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nospoi~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skstay~m_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skcool~r_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
sktal~ad_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)
(15166 missing values generated)

                 managing_emotions_index_el2
{hline 61}
      Percentiles      Smallest
 1%    {res}-4.839373      -6.408284
{txt} 5%    {res}-3.492947      -5.808985
{txt}10%    {res}-3.492947      -5.808985       {txt}Obs         {res}        971
{txt}25%    {res}-1.628731      -5.808985       {txt}Sum of Wgt. {res}        971

{txt}50%    {res} .1539783                      {txt}Mean          {res} 5.44e-08
                        {txt}Largest       Std. Dev.     {res} 2.307199
{txt}75%    {res} 2.281609       4.284616
{txt}90%    {res} 3.126598       4.284616       {txt}Variance      {res} 5.323165
{txt}95%    {res} 3.315004       4.284616       {txt}Skewness      {res}-.0819424
{txt}99%    {res} 4.284616       4.284616       {txt}Kurtosis      {res} 2.181233
{txt}(971 real changes made)

{com}. 
. local mediation_index_vars noadviseop_el2 noadviseco_el2 nomediateop_el2 nomediateco_el2 ///
>         nohelpcompop_el2 nohelpcompco_el2 skbringtogether_el2 skhelpagree_el2 ///
>         skhelpunderstand_el2 skcooltemperothers_el2 
{txt}
{com}. make_index `mediation_index_vars', indexname(mediation_index_el2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
noadvi~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
noadvi~o_el2 {c |}{res}          0
{txt}(0 real changes made)
(15169 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nomedi~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nomedi~o_el2 {c |}{res}          0
{txt}(0 real changes made)
(15168 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nohelp~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nohelp~o_el2 {c |}{res}          0
{txt}(0 real changes made)
(15169 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skbrin~r_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skhelp~e_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skhelp~d_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skcool~s_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)
(15166 missing values generated)

                     mediation_index_el2
{hline 61}
      Percentiles      Smallest
 1%    {res}-11.50833      -18.15556
{txt} 5%    {res}-7.530588      -16.05415
{txt}10%    {res}-6.165969      -14.31468       {txt}Obs         {res}        971
{txt}25%    {res}-3.224505      -12.75883       {txt}Sum of Wgt. {res}        971

{txt}50%    {res} .2431146                      {txt}Mean          {res}-4.27e-08
                        {txt}Largest       Std. Dev.     {res} 4.645251
{txt}75%    {res} 3.043532       10.88324
{txt}90%    {res} 5.619147       10.88324       {txt}Variance      {res} 21.57835
{txt}95%    {res} 7.654574       10.88324       {txt}Skewness      {res} -.167689
{txt}99%    {res} 10.88324       10.88324       {txt}Kurtosis      {res} 2.994324
{txt}(971 real changes made)

{com}. 
. local negotiation_index_vars nocompromop_el2 nocompromco_el2 nogiftop_el2 nogiftco_el2 ///
>         sktalkpalava_el2 sktalkgood_el2 skproposesolution_el2 skcompromise_el2 ///
>         skforgive_el2
{txt}
{com}. make_index `negotiation_index_vars', indexname(negotiation_index_el2)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nocomp~p_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nocomp~o_el2 {c |}{res}          0
{txt}(0 real changes made)
(15171 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nogiftop_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
nogiftco_el2 {c |}{res}          0
{txt}(0 real changes made)
(15180 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
sktalk~a_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
sktal~od_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skprop~n_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skcomp~e_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)

    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
skforg~e_el2 {c |}{res}          0
{txt}(0 real changes made)
(15166 missing values generated)
(15166 missing values generated)

                    negotiation_index_el2
{hline 61}
      Percentiles      Smallest
 1%    {res}-11.79233       -13.6727
{txt} 5%    {res}-9.598925       -13.6727
{txt}10%    {res}-7.081244      -13.03723       {txt}Obs         {res}        971
{txt}25%    {res}-3.120098      -13.03723       {txt}Sum of Wgt. {res}        971

{txt}50%    {res} .9577662                      {txt}Mean          {res} 1.66e-08
                        {txt}Largest       Std. Dev.     {res} 4.831835
{txt}75%    {res} 3.365407       10.19272
{txt}90%    {res} 5.574862       10.53178       {txt}Variance      {res} 23.34663
{txt}95%    {res} 6.600381       10.72554       {txt}Skewness      {res}-.5847752
{txt}99%    {res} 8.787201       10.72554       {txt}Kurtosis      {res} 2.819599
{txt}(971 real changes made)

{com}. 
. 
. ********************************************************************************
. * Cheat! Fill in the _ec2 variables with leader data ***************************
. ********************************************************************************
. /*      When I make tables down the line, i want to be able to input one list of 
>         variables, and then be able to run regressions for leaders and residents at 
>         once. So I make the _ec2 indices the resident one for leaders. Remember that
>         leaders and residents are mutually exclusive groups, so no data is being
>         overwritten. This just means we need to be careful with using if statements
>         whenever we do anything. 
> */
. foreach sub in bias_index defection_index empathy_index ///
> forum_choice_index managing_emotions_index mediation_index negotiation_index {c -(}
{txt}  2{com}.                 replace `sub'_ec2 = `sub'_el2 if (ENDLINE2_LEADER == 1)
{txt}  3{com}.  {c )-}
{txt}(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)
(971 real changes made)

{com}. 
. 
. 
. ********************************************************************************
. * Add correct suffixes for resident and targeted resident data *****************
. ********************************************************************************
. /* I'm not sure the global $ate_ctrls exists, but I'm too afraid to delete it. 
> */
. foreach x in ///
>         $ate_ctrls $ate_ctrls_l $comm_ctrls christian age land_size farm_size cashearn_imputed displa_rfugem    /// 
>         jpc_attend minority under30 prgrsv_attitudes jpc_attend_risk_ls minortribe_assigned jpc_attend_highrisk_ls      /// 
>         money_resolution_type displaced refugee land_resolution_type viol_experienced   ///
>         housetake_dum lndtake_dum lndhousetake_dum log_land_size log_farm_size land_size displa_rfugem landless ///
>         farm_size farmless propdest_landconf viol_landconf threat_landconf ///
>         female stranger yrs_edu noland ageover60 age40_60 age20_40 under30 wealthindex chiefrel_dup minority minortribe prog_ldr_beliefs ///
>         mnyconf {c -(}
{txt}  2{com}.         
.                 cap local lbl: variable label `x'               
{txt}  3{com}.                 cap local lbl: variable label `x'_et            
{txt}  4{com}.                 cap local lbl: variable label `x'_ec
{txt}  5{com}.                 cap local lbl: variable label `x'_el
{txt}  6{com}.                 cap local lbl: variable label `x'_el2           
{txt}  7{com}.                 cap local lbl: variable label `x'_ec2
{txt}  8{com}.                 
.                 cap gen `x'=`x'_et if TARGETED_RESIDENT==1
{txt}  9{com}.                 cap gen `x'=`x'_ec if ENDLINE_RESIDENT==1
{txt} 10{com}.                 cap gen `x'=`x'_el if ENDLINE_LEADER==1
{txt} 11{com}.                 cap gen `x'=`x'_ec2 if ENDLINE2_RESIDENT==1
{txt} 12{com}.                 cap gen `x'=`x'_el2 if ENDLINE2_LEADER==1
{txt} 13{com}.                                                         
.                 cap replace `x'=`x'_et if TARGETED_RESIDENT==1
{txt} 14{com}.                 cap replace `x'=`x'_ec if ENDLINE_RESIDENT==1
{txt} 15{com}.                 cap replace `x'=`x'_el if ENDLINE_LEADER==1 // LEADERS DONT HAVE ALL VARS THAT TRAINEES AND CITIZENS DO
{txt} 16{com}.                 cap replace `x'=`x'_ec2 if ENDLINE2_RESIDENT==1
{txt} 17{com}.                 cap replace `x'=`x'_el2 if ENDLINE2_LEADER==1
{txt} 18{com}.                 
.                 cap la var `x' "`lbl'"
{txt} 19{com}. {c )-}
{txt}
{com}. 
. 
. ********************************************************************************
. * Add value lables to money resolution variables *******************************
. ********************************************************************************
. la values money_resolution_type money_resolution_type
{txt}
{com}. la values land_resolution_type land_resolution_type                     
{txt}
{com}. 
. foreach y in land_size farm_size cashearn_imputed displa_rfugem {c -(}
{txt}  2{com}.         local lab : var label `y'
{txt}  3{com}.         gen `y'hst = ln(`y'+((`y'^2)+1)^.5)
{txt}  4{com}.                 la var `y'hst "Hst: `lab'"
{txt}  5{com}. {c )-}       
{txt}(5,750 missing values generated)
(6,690 missing values generated)
(4,781 missing values generated)
note: label truncated to 80 characters
(10,726 missing values generated)

{com}. 
. 
. 
. ********************************************************************************
. * Add miscellaneous variables **************************************************
. ********************************************************************************
. /*      Apologies for the miscellaneous section. It is bad practice. However this
>         has been ported over from much messier and worse code. 
> */
. 
.         
. * Indicator for resident or targeted resident **********************************
. 
. gen resident=cond(TARGETED_RESIDENT==1 | ENDLINE_RESIDENT==1 | ENDLINE2_RESIDENT==1,1,0 )
{txt}
{com}. 
. gen targ_or_leader=cond(TARGETED_RESIDENT==1 | ENDLINE_LEADER==1 | ENDLINE2_LEADER==1,1,0)                                      
{txt}
{com}. 
. 
. * Respondent type **************************************************************
. 
. gen leader=(ENDLINE_LEADER==1) if ENDLINE_LEADER==1 | ENDLINE_RESIDENT==1 | TARGETED_RESIDENT==1
{txt}(9,762 missing values generated)

{com}.         la var leader "Leader"
{txt}
{com}. 
. gen trainee=(TARGETED_RESIDENT==1) if ENDLINE_LEADER==1 | ENDLINE_RESIDENT==1 | TARGETED_RESIDENT==1 // used as control in pooled resident and targeted resident regressions
{txt}(9,762 missing values generated)

{com}.         la var trainee "Targeted resident"
{txt}
{com}. 
. * Displaced or refugee *********************************************************
. 
. gen displ_or_refugee = (displaced==1 | refugee==1)
{txt}
{com}.         la var displ_or_refugee "Was displaced or a refugee"
{txt}
{com}. 
. * Town size ********************************************************************
. 
. replace ctownhh_el=133 if ctownhh_el==. & town=="Baylaybo" 
{txt}(46 real changes made)

{com}. replace ctownpop_el=1388 if ctownpop_el==. & town=="Baylaybo" 
{txt}(46 real changes made)

{com}. 
. **NOTE: updated for the endline2
. gen ctownhh_log_el2=log(ctownhh_el2)
{txt}(3 missing values generated)

{com}. la var ctownhh_log_el2 "Log of town population"
{txt}
{com}. 
. 
. * small community dummies by quartile ******************************************
.                 
. xtile quart = ctownpop_el2 if ENDLINE2_LEADER==1 | ENDLINE2_RESIDENT==1 | COMMLEVEL==1, nq(4) 
{txt}
{com}. 
. gen vsmall = (commcode==1050 | commcode==1312 | commcode==2290 | commcode==2850)
{txt}
{com}. 
. gen small = (quart==1) if quart!=.
{txt}(10,981 missing values generated)

{com}.         la var small "1 if community in 1st quartile for population"
{txt}
{com}.         
. gen small2 = (quart==2) if quart!=.
{txt}(10,981 missing values generated)

{com}.         la var small2 "1 if community in 2nd quartile for population"
{txt}
{com}. 
. gen small3 = (quart==3) if quart!=.
{txt}(10,981 missing values generated)

{com}.         la var small3 "1 if community in 3rd quartile for population"
{txt}
{com}. 
. gen small4 = (quart==4) if quart!=.
{txt}(10,981 missing values generated)

{com}.         la var small4 "1 if community in 4th quartile for population"
{txt}
{com}.                         
. 
. *placevar ctownhh_log_el2 small small2 small3 small4, after(quart)
. drop quart              
{txt}
{com}. 
. ********************************************************************************        
. * Construct variables for Heterogeneity Analysis *******************************
. ********************************************************************************
. 
. * Make new binaries for community size and related to powerful person **********
. 
.         * Lives in a small community? **********************************************
.         gen comm_small=0 
{txt}
{com}.         replace comm_small=1 if small==1 | small2==1
{txt}(2,597 real changes made)

{com}.         label var comm_small "indicator of below median size"
{txt}
{com}. 
.         * Related to a powerful person? ********************************************
.         gen rltn_to_powerful=0
{txt}
{com}.         replace rltn_to_powerful=1 if chiefrel_dup==1
{txt}(2,675 real changes made)

{com}.         label var rltn_to_powerful "Are you related to a big person from before or after the war"
{txt}
{com}. 
. 
. * For loop to make new variables ***********************************************
. foreach y in female age40_60 age20_40 under30 cwealthindex_bc rltn_to_powerful minority minortribe {c -(}
{txt}  2{com}.         local lab : var label `y'
{txt}  3{com}.         gen assigned_`y' = assigned_ever * `y'
{txt}  4{com}.         la var assigned_`y' "`lab' * assigned_ever"
{txt}  5{com}.         gen treated_`y' = treated_ever * `y'
{txt}  6{com}.         la var treated_`y' "`lab' * treated_ever" 
{txt}  7{com}. {c )-}
{txt}(4,779 missing values generated)
(4,779 missing values generated)
(4,779 missing values generated)
(4,779 missing values generated)
(4,779 missing values generated)
(4,779 missing values generated)
(5,719 missing values generated)
(5,719 missing values generated)
(3 missing values generated)
(3 missing values generated)
(4,780 missing values generated)
(4,780 missing values generated)
(10,702 missing values generated)
(10,702 missing values generated)

{com}.                                 
.                         
. ********************************************************************************
. * Constructing new violence measures *******************************************
. ********************************************************************************
. 
. * Participation in violence ****************************************************
. egen anyviol_el2 = rowmax(tribviol_dum_el2 strkviol_dum_el2 pvytheld_dum_el2 strkpeac_dum_el2 cfamlndcn_dum_el2 dtwnldcn_dum_el2  suspwitc_dum_el2 sasycutl_dum_el2)
{txt}(3 missing values generated)

{com}.         la var anyviol_el2 "Indicator for any violence (Table 7 col. 1-8)"
{txt}
{com}.          
. egen sumviol_el2 = rowtotal(tribviol_dum_el2 strkviol_dum_el2 pvytheld_dum_el2 strkpeac_dum_el2 cfamlndcn_dum_el2 dtwnldcn_dum_el2  suspwitc_dum_el2 sasycutl_dum_el2), m
{txt}(3 missing values generated)

{com}. replace sumviol_el2 = . if missing(tribviol_dum_el2) & missing(strkviol_dum_el2) & !missing(cfamlndcn_dum_el2)
{txt}(15,163 real changes made, 15,163 to missing)

{com}.         la var sumviol_el2 "Overall violence indicator (0-9) (Table 7 col. 1-8)"
{txt}
{com}. 
. egen sasywitch_el2 = rowmax(suspwitc_dum_el2 sasycutl_dum_el2) 
{txt}(15166 missing values generated)

{com}.         la var sasywitch_el2 "Witch killing or trial by ordeal"
{txt}
{com}. 
. 
. * Indicators for money + land disputes *****************************************
. 
. 
. * Making dummies?  what the fuck is going on here? 
. gen unrsvl_u_ec2 = unrslv_lnd_conf_u_ec2
{txt}(12,125 missing values generated)

{com}. gen conf_u_ec2= anylndconf_u_ec2
{txt}(12,125 missing values generated)

{com}. gen mnyconflength1_u_st_ec2 = mnyconf_length1_u_ec2
{txt}(12,126 missing values generated)

{com}. gen unrslv_conf_u_ec2 = unrslv_lnd_conf_u_ec2
{txt}(12,125 missing values generated)

{com}. gen mnyunrslv_conf_u_ec2 = mnyconf_unrslv_u_ec2
{txt}(12,267 missing values generated)

{com}. gen mnyconf_u_ec2= mnyconf_ec2
{txt}(12,126 missing values generated)

{com}. 
. * Disputes
. * Max (0,1 indicator)
. foreach var in conf_u_ec2 unrslv_conf_u_ec2 conf_freq_u_ec2 {c -(}
{txt}  2{com}.         egen lm_`var' = rowmax(`var' mny`var') if !missing(`var') | !missing(mny`var')
{txt}  3{com}.         la var lm_`var' "`var', land and money disputes"
{txt}  4{com}. {c )-}
{txt}(12125 missing values generated)
(12125 missing values generated)
(12125 missing values generated)

{com}.  
. * Mean (dispute length, months)
. foreach var in conflength1_u_st_ec2 {c -(}
{txt}  2{com}.         egen lm_`var' = rowmean(`var' mny`var') if !missing(`var') | !missing(mny`var')
{txt}  3{com}.         la var lm_`var' "`var', land and money disputes"
{txt}  4{com}. {c )-}
{txt}(12125 missing values generated)

{com}. 
. * Violence
. * Max (0,1 indicator)
. foreach var in conf_any_u_ec2 conf_threat_u_ec2 conf_witch_u_ec2 conf_damage_u_ec2 conf_viol_u_ec2 {c -(}
{txt}  2{com}.         egen lm_`var' = rowmax(`var' mny`var') if !missing(`var') | !missing(mny`var')
{txt}  3{com}.         la var lm_`var' "`var', land and money disputes"
{txt}  4{com}. {c )-}
{txt}(12125 missing values generated)
(12125 missing values generated)
(12125 missing values generated)
(12125 missing values generated)
(12125 missing values generated)

{com}. 
. * Resolution
. * Max (0,1 indicator)
. foreach var in forum_lastsuc_c_ec2   forum_inf_suc_c_ec2 forum_lastsat_c_ec2  {c -(}
{txt}  2{com}.         egen lm_`var' = rowmax(`var' mny`var') if !missing(`var') | !missing(mny`var')
{txt}  3{com}.         la var lm_`var' "`var', land and money disputes"
{txt}  4{com}. {c )-}
{txt}(15338 missing values generated)
(15338 missing values generated)
(15338 missing values generated)

{com}. 
. * Mean (# of forums used)
. foreach var in conf_forum_c_ec2  {c -(}
{txt}  2{com}.         egen lm_`var' = rowmean(`var' mny`var') if !missing(`var') | !missing(mny`var')
{txt}  3{com}.         la var lm_`var' "`var', land and money disputes"
{txt}  4{com}. {c )-}
{txt}(15338 missing values generated)

{com}. 
. 
. * Any money or land fighting, conditional on dispute
. gen lm_conf_any_c_ec2 = conf_any_u_ec2 if lm_conf_u_ec2==1 
{txt}(15,338 missing values generated)

{com}. 
. 
. * Indicators for money + land + gender disputes ********************************
. gen wmconflength1_u_st_ec2 = wmconf_length1_u_ec2
{txt}(12,127 missing values generated)

{com}. gen wmunrslv_conf_u_ec2 = wmconf_unrslv_u_ec2
{txt}(12,293 missing values generated)

{com}. gen wmconf_u_ec2= wmconf_ec2
{txt}(12,127 missing values generated)

{com}. 
. foreach x in la1palavalength_ec2 mopalavalength_ec2 wopalavalength_ec2 {c -(}
{txt}  2{com}.         replace `x' = 0 if missing(`x') & ENDLINE2_RESIDENT==1
{txt}  3{com}. {c )-}
{txt}(3,886 real changes made)
(3,493 real changes made)
(3,355 real changes made)

{com}. 
. * Disputes
. * Max (0,1 indicator)
. foreach var in conf_u_ec2 unrslv_conf_u_ec2 conf_freq_u_ec2 {c -(}
{txt}  2{com}.         egen lmg_`var' = rowmax(`var' mny`var' wm`var') if !missing(`var') | !missing(mny`var') | !missing(wm`var')
{txt}  3{com}.         la var lmg_`var' "`var', land, money, and gender disputes"
{txt}  4{com}. {c )-}
{txt}(12125 missing values generated)
(12125 missing values generated)
(12125 missing values generated)

{com}. 
. * Violence
. * Max (0,1 indicator)
. foreach var in conf_any_u_ec2 conf_threat_u_ec2 conf_witch_u_ec2 conf_damage_u_ec2 conf_viol_u_ec2 {c -(}
{txt}  2{com}.         egen lmg_`var' = rowmax(`var' mny`var' wm`var') if !missing(`var') | !missing(mny`var') | !missing(wm`var')
{txt}  3{com}.         la var lmg_`var' "`var', land, money, and gender disputes"
{txt}  4{com}. {c )-}
{txt}(12125 missing values generated)
(12125 missing values generated)
(12125 missing values generated)
(12125 missing values generated)
(12125 missing values generated)

{com}. 
. * Resolution
. * Max (0,1 indicator)
. foreach var in forum_lastsuc_c_ec2 forum_inf_suc_c_ec2 forum_othsuc_c_ec2  forum_lastsat_c_ec2 forum_inf_sat_c_ec2 forum_othsat_c_ec2 {c -(}
{txt}  2{com}.         egen lmg_`var' = rowmax(`var' mny`var' wm`var') if !missing(`var') | !missing(mny`var') | !missing(wm`var')
{txt}  3{com}.         la var lmg_`var' "`var', land, money, and gender disputes"
{txt}  4{com}. {c )-}
{txt}(14910 missing values generated)
(14910 missing values generated)
(16118 missing values generated)
(14910 missing values generated)
(14910 missing values generated)
(16118 missing values generated)

{com}. 
. * Mean (# of forums used)
. foreach var in conf_forum_c_ec2  {c -(}
{txt}  2{com}.         egen lmg_`var' = rowmean(`var' mny`var' wm`var') if !missing(`var') | !missing(mny`var') | !missing(wm`var')
{txt}  3{com}.         la var lmg_`var' "`var', land, money, and gender disputes"
{txt}  4{com}.         replace lmg_`var' = 0 if lmg_`var'<0 & !missing(lmg_`var')
{txt}  5{com}. {c )-}
{txt}(14910 missing values generated)
(0 real changes made)

{com}. 
. * Any money, land or gender fighting, conditional on dispute
. foreach var in conf_any_c_ec2 {c -(}
{txt}  2{com}.         egen lmg_`var' = rowmax(`var' mny`var' wm`var') if lmg_conf_u_ec2==1
{txt}  3{com}.         la var lmg_`var' "`var', land, money, and gender disputes"
{txt}  4{com}. {c )-}       
{txt}(14910 missing values generated)

{com}. 
. // ANY GENDER DISPUTE
. gen finsult_et = finsltpt_et
{txt}(16,038 missing values generated)

{com}. gen mwconflict_et = 0 if TARGETED_RESIDENT==1&(!missing(minsult_et)|!missing(finsult_et))
{txt}(15,706 missing values generated)

{com}. foreach var in insult_et threatht_et pushhit_et kckdrag_et  {c -(}
{txt}  2{com}.         foreach s in m f {c -(}
{txt}  3{com}.                 replace mwconflict_et=1 if `s'`var'==1 | `s'`var'==2 | `s'`var'==3
{txt}  4{com}.         {c )-}
{txt}  5{com}. {c )-}
{txt}(50 real changes made)
(19 real changes made)
(9 real changes made)
(3 real changes made)
(2 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)

{com}. la var mwconflict_et "reports m/f conflict"
{txt}
{com}. 
. ** ANY CONFLICT (LAND + CONFLICT + GENDER )
. egen lmg_conflict_ec = rowmax(anylndconf_alt2_ec mnyconf_ec mwconflict_et )
{txt}(10905 missing values generated)

{com}. la var lmg_conflict_ec "Any conflict (L+M+G)"
{txt}
{com}. 
. 
. 
. ********************************************************************************
. * Dummies for the cause of conflict ********************************************
. ********************************************************************************
. /*      One observation in la1palavaabout is 0, meaning none. I just change this to
>         "other"
> */
. replace la1palavaabout_ec2 = 88 if la1palavaabout == 0
{txt}(1 real change made)

{com}. 
. gen house_cause_boundaries              = la1palavaabout_ec2 == 1
{txt}
{com}. gen house_cause_inherit                 = la1palavaabout_ec2 == 2
{txt}
{com}. gen house_cause_use                     = la1palavaabout_ec2 == 3
{txt}
{com}. gen house_cause_other_issue     = la1palavaabout_ec2 == 88
{txt}
{com}. 
. gen farm_cause_boundaries               = la2palavaabout_ec2 == 1
{txt}
{com}. gen farm_cause_inherit                  = la2palavaabout_ec2 == 2
{txt}
{com}. gen farm_cause_use                              = la2palavaabout_ec2 == 3
{txt}
{com}. gen farm_cause_other_issue              = la2palavaabout_ec2 == 88
{txt}
{com}. 
. gen other_cause_boundaries              = la3palavaabout_ec2 == 1
{txt}
{com}. gen other_cause_inherit                 = la3palavaabout_ec2 == 2
{txt}
{com}. gen other_cause_use                     = la3palavaabout_ec2 == 3
{txt}
{com}. gen other_cause_other_issue     = la3palavaabout_ec2 == 88
{txt}
{com}. 
. gen mny_cause_other_payback             = mopalavaabout_ec2 == 1
{txt}
{com}. gen mny_cause_i_payback                 = mopalavaabout_ec2 == 2
{txt}
{com}. gen mny_cause_other_stole               = mopalavaabout_ec2 == 3
{txt}
{com}. gen mny_cause_i_stole                   = mopalavaabout_ec2 == 4
{txt}
{com}. gen mny_cause_other_cheated             = mopalavaabout_ec2 == 5
{txt}
{com}. gen mny_cause_i_cheated                 = mopalavaabout_ec2 == 6
{txt}
{com}. gen mny_cause_other_issue               = mopalavaabout_ec2 == 88
{txt}
{com}. 
. gen wm_cause_sex                                = wopalavaabout_ec2 == 1
{txt}
{com}. gen wm_cause_money                              = wopalavaabout_ec2 == 2
{txt}
{com}. gen wm_cause_disrespect                 = wopalavaabout_ec2 == 3
{txt}
{com}. gen wm_cause_listening                  = wopalavaabout_ec2 == 4
{txt}
{com}. gen wm_cause_stealing                   = wopalavaabout_ec2 == 5
{txt}
{com}. gen wm_cause_disobeying                 = wopalavaabout_ec2 == 6
{txt}
{com}. gen wm_cause_children                   = wopalavaabout_ec2 == 7
{txt}
{com}. gen wm_cause_nonsupport                 = wopalavaabout_ec2 == 8
{txt}
{com}. 
. 
. 
. ********************************************************************************
. * Construct variable on Political Connectedness Level **************************        
. ********************************************************************************
. label def binary 0 "N" 1 "Y", replace
{txt}
{com}. 
. foreach var in currentlead chiefrelp pastlead chiefrelc {c -(}
{txt}  2{com}.         encode `var'_ec2, gen(`var'_b_ec2) label(binary)
{txt}  3{com}. {c )-}
{txt}
{com}. gen polcnnct_ec2 =  currentlead_b_ec2 + chiefrelp_b_ec2 + pastlead_b_ec2 + chiefrelc_b_ec2
{txt}(12,126 missing values generated)

{com}.         la var polcnnct_ec2 "Political connection, 0-4"
{txt}
{com}.         
. qui sum polcnnct_ec2, d
{txt}
{com}. gen polcnnct_b_ec2 = polcnnct_ec2>r(p50) if !missing(polcnnct_ec2)
{txt}(12,126 missing values generated)

{com}.         la var polcnnct_b_ec2 "Above median political connectedness"
{txt}
{com}. 
. gen a_polcnnct_b_ec2 = assigned*polcnnct_b_ec2
{txt}(12,126 missing values generated)

{com}.         la var a_polcnnct_b_ec2 "Assigned X above median pol cnnct"     
{txt}
{com}. 
. 
. ********************************************************************************
. * Construct a variable about political district and ownership ******************
. ********************************************************************************
. 
. la de owner2 1 "Me" 2 "My family/household" 3 "My extended family" 4 "Other person (same tribe)" 5 "Other person different tribe" 97 "Don't know" 88 "N/A"
{txt}
{com}. la val la1houseown owner2
{txt}
{com}. la val la2farmown owner2
{txt}
{com}. 
. 
. ********************************************************************************
. * Construct variables about plot-level violence ********************************
. ********************************************************************************        
. local housenum 1
{txt}
{com}. local farmnum 2
{txt}
{com}. local othernum 3
{txt}
{com}. 
. 
. foreach type in house farm other {c -(}
{txt}  2{com}.         * conflicts about land
.         label def binary 0 "N" 1 "Y", replace
{txt}  3{com}.         encode la``type'num'palava_ec2, gen(conf_plot_`type') label(binary)
{txt}  4{com}.         la var conf_plot_`type' "`type' dispute"
{txt}  5{com}.         
.         * unresolved conflicts 
.         gen unresolve_`type' = -1*la``type'num'resolvelastsuc_c_ec2+1
{txt}  6{com}.         replace unresolve_`type'= 0 if missing(unresolve_`type') & ENDLINE2_RESIDENT==1
{txt}  7{com}.         la var unresolve_`type' "Unresolved dispute"
{txt}  8{com}.         
.         * Number of months of dispute 
.         gen conf_m_`type' = la``type'num'palavalength_ec2 if la``type'num'palavaunit_ec2 =="2-months"
{txt}  9{com}.         replace conf_m_`type' = la``type'num'palavalength_ec2 / (365/12) if la``type'num'palavaunit_ec2 =="1-Days"
{txt} 10{com}.         replace conf_m_`type' = la``type'num'palavalength_ec2 * 12 if la``type'num'palavaunit_ec2 =="3-Years"
{txt} 11{com}.         qui sum conf_m_`type' if conf_plot_`type' == 1, d 
{txt} 12{com}.         replace conf_m_`type'=r(p95) if conf_m_`type'>r(p95) & !missing(conf_m_`type') 
{txt} 13{com}.         replace conf_m_`type'=0 if missing(conf_m_`type') & ENDLINE2_RESIDENT==1
{txt} 14{com}.         la var conf_m_`type' "Conflict length (months), `type'"
{txt} 15{com}.         
.         * Types of Violence
.         label def binary 0 "N" 1 "Y", replace
{txt} 16{com}.         foreach v in threat witch damage viol {c -(}
{txt} 17{com}.                 cap drop __00*
{txt} 18{com}.                 encode la``type'num'palava`v'_ec2, gen(`v'_`type') label(binary)
{txt} 19{com}.                 la var `v'_`type' "`type' dispute resulted in `v'"
{txt} 20{com}.                 replace `v'_`type'= 0 if missing(`v'_`type') & ENDLINE2_RESIDENT==1
{txt} 21{com}.         {c )-}
{txt} 22{com}.         rename threat_`type' threaten_`type'
{txt} 23{com}.         rename witch_`type' witchcrft_`type'
{txt} 24{com}.         rename viol_`type' viole_`type'
{txt} 25{com}.         
.         * Any threat or violence *
.         gen anythreatviol_`type' = (threaten_`type'==1 |viole_`type'==1|witchcrft_`type'==1|damage_`type'==1) 
{txt} 26{com}.         la var anythreatviol_`type' "Any threat or violence in `type' dispute"
{txt} 27{com}.         gen anythreatviol_c_`type' = anythreatviol_`type' if conf_plot_`type'==1
{txt} 28{com}.         la var anythreatviol_c_`type' "Any threat or violence, conditional"
{txt} 29{com}.         
.         * Resolved land dispute
.         gen resolve_`type' = 0 if la``type'num'resolvelastsuc_ec2=="0-No"
{txt} 30{com}.         replace resolve_`type'= 1 if la``type'num'resolvelastsuc_ec2=="1-Yes"
{txt} 31{com}.         la var resolve_`type' "Resolved dispute, `type'"
{txt} 32{com}.         
.         * Number of forums used
.         foreach count in 1 2 3 4 oth {c -(}
{txt} 33{com}.                 gen forum_`count'_`type' = (la``type'num'resolve`count'_ec2!= "88-N/A" ) if !inlist(la``type'num'resolve`count'_ec2, "", ".")
{txt} 34{com}.                 la var forum_`count'_`type' "Went to `count' forum for `type' dispute"
{txt} 35{com}.         {c )-}
{txt} 36{com}.         egen forums_`type'= rowtotal(forum_1_`type' forum_2_`type' forum_3_`type' forum_4_`type' forum_oth_`type'),m
{txt} 37{com}.         replace forums_`type'=. if missing(resolve_`type')
{txt} 38{com}.         la var forums_`type' "Total # of forums used for `type' dispute"
{txt} 39{com}.         cap drop __00*
{txt} 40{com}.         
.         * Resolved via informal mechanism
.         label def tertiary 0 "0-No" 1 "1-Yes", replace
{txt} 41{com}.         foreach v in resolveagree  {c -(}
{txt} 42{com}.                 encode la``type'num'`v'_ec2, gen(`v'_`type') label(tertiary)
{txt} 43{com}.                 replace `v'_`type' = . if `v'_`type'==2
{txt} 44{com}.                 la var `v'_`type' "Resolve via `v', `type'"
{txt} 45{com}.         {c )-}
{txt} 46{com}.         gen rslve_inf_`type' = resolveagree_`type'==1 if !missing(resolveagree_`type')  & inlist(resolve_`type',0,1)
{txt} 47{com}.         replace rslve_inf_`type' = 0 if missing(resolveagree_`type')  & inlist(resolve_`type',0,1)
{txt} 48{com}.         la var rslve_inf_`type' "Resolved `type' dispute by informal mechanism"
{txt} 49{com}.         
.         * Satisfied with outcome
.         qui gen satisfied_`type' = 1 if inlist(la``type'num'resolvelastsat_ec2,"1-Very satisfied", "2-Satisfied")
{txt} 50{com}.         replace  satisfied_`type' = 0 if inlist(la``type'num'resolvelastsat_ec2,"3-Not satisfied", "4-Not satisfied at all")
{txt} 51{com}.         
.         * Used community forum as last
.         gen forum_community_`type' = inlist(la``type'num'resolvelast_ec2,"10-Family, friends or neighbors", "14-Landlord", "16-Local NGOs", "23-Peace Committee") if la``type'num'palava_ec2=="Y"
{txt} 52{com}.         replace forum_community_`type' = 1 if inlist(la``type'num'resolvelast_ec2,"9-Elders","26-Sectional chief", "27-Town Chief", "3-Clan Chief") & la``type'num'palava_ec2=="Y"
{txt} 53{com}.         replace forum_community_`type' = 1 if inlist(la``type'num'resolvelast_ec2,"28-Traditional authority","30-quarter Chief") & la``type'num'palava_ec2=="Y"         
{txt} 54{com}.         replace forum_community_`type' = . if inlist(la``type'num'resolvelast_ec2,"88-N/A", "32-Other") & la``type'num'palava_ec2=="Y"          
{txt} 55{com}.         la var forum_community_`type' "Used community forum for `count' dispute"
{txt} 56{com}. {c )-}
{txt}(16,032 missing values generated)
(3,907 real changes made)
(16,137 missing values generated)
(28 real changes made)
(42 real changes made)
(3 real changes made)
(3,942 real changes made)
(3,886 real changes made)
(3,886 real changes made)
(3,886 real changes made)
(3,886 real changes made)
{res}{txt}(16,011 missing values generated)
(16,114 missing values generated)
(82 real changes made)
(16,011 missing values generated)
(16,012 missing values generated)
(16,103 missing values generated)
(16,121 missing values generated)
(16,134 missing values generated)
(16011 missing values generated)
(21 real changes made, 21 to missing)
(1 real change made, 1 to missing)
(16,032 missing values generated)
(0 real changes made)
(18 real changes made)
(16,011 missing values generated)
(27 real changes made)
(6 real changes made)
(22 real changes made, 22 to missing)
(16,003 missing values generated)
(3,878 real changes made)
(16,137 missing values generated)
(28 real changes made)
(79 real changes made)
(5 real changes made)
(3,905 real changes made)
(3,857 real changes made)
(3,857 real changes made)
(3,857 real changes made)
(3,857 real changes made)
{res}{txt}(15,982 missing values generated)
(16,082 missing values generated)
(80 real changes made)
(15,982 missing values generated)
(15,984 missing values generated)
(16,092 missing values generated)
(16,125 missing values generated)
(16,131 missing values generated)
(15982 missing values generated)
(20 real changes made, 20 to missing)
(11 real changes made, 11 to missing)
(16,005 missing values generated)
(3 real changes made)
(47 real changes made)
(15,982 missing values generated)
(52 real changes made)
(9 real changes made)
(26 real changes made, 26 to missing)
(16,071 missing values generated)
(3,946 real changes made)
(16,137 missing values generated)
(31 real changes made)
(27 real changes made)
(2 real changes made)
(3,954 real changes made)
(3,919 real changes made)
(3,919 real changes made)
(3,918 real changes made)
(3,919 real changes made)
{res}{txt}(16,044 missing values generated)
(16,116 missing values generated)
(45 real changes made)
(16,044 missing values generated)
(16,046 missing values generated)
(16,119 missing values generated)
(16,129 missing values generated)
(16,135 missing values generated)
(16044 missing values generated)
(27 real changes made, 27 to missing)
(4 real changes made, 4 to missing)
(16,074 missing values generated)
(3 real changes made)
(21 real changes made)
(16,044 missing values generated)
(18 real changes made)
(3 real changes made)
(32 real changes made, 32 to missing)

{com}.  
.  * Mean (dispute length, months)
. egen conf_length_max_u_ec2 = rowmax(conf_m_house conf_m_farm conf_m_other) 
{txt}(12125 missing values generated)

{com}. egen conf_length_mean_u_ec2 = rowmean(conf_m_house conf_m_farm conf_m_other) 
{txt}(12125 missing values generated)

{com}. 
. gen conf_length_max_c_ec2 = conf_length_max_u_ec2 if anylndconf_u_ec2 == 1
{txt}(15,784 missing values generated)

{com}. gen conf_length_mean_c_ec2 = conf_length_mean_u_ec2 if anylndconf_u_ec2 == 1
{txt}(15,784 missing values generated)

{com}. 
. 
. * Cap conflict length for money and gender conflict because we did so for land.
. sum mnyconf_length1_u_ec2 if mnyconf_u_ec2 == 1, detail 

      {txt}uncond: first measure of length of money disputes
                        (unit: month)
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        1              0
{txt}10%    {res}        1              0       {txt}Obs         {res}        519
{txt}25%    {res}        1              0       {txt}Sum of Wgt. {res}        519

{txt}50%    {res}        1                      {txt}Mean          {res}  2.38921
                        {txt}Largest       Std. Dev.     {res} 2.349887
{txt}75%    {res}        3             11
{txt}90%    {res}        6             11       {txt}Variance      {res} 5.521968
{txt}95%    {res}        8             11       {txt}Skewness      {res}  1.92645
{txt}99%    {res}       10             11       {txt}Kurtosis      {res} 6.097694
{txt}
{com}. replace mnyconf_length1_u_ec2 = r(p95) if mnyconf_length1_u_ec2 > r(p95) & !missing(mnyconf_length1_u_ec2)
{txt}(24 real changes made)

{com}. 
. 
. sum wmconf_length1_u_ec2 if wmconf_u_ec2 == 1, detail

        {txt}uncond: first measure of length of man-woman
                   disputes (unit: month)
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}       .5              0
{txt}10%    {res}        1              0       {txt}Obs         {res}        657
{txt}25%    {res}        1              0       {txt}Sum of Wgt. {res}        657

{txt}50%    {res}        1                      {txt}Mean          {res} 4.499619
                        {txt}Largest       Std. Dev.     {res} 10.49924
{txt}75%    {res}        3             72
{txt}90%    {res}       12            108       {txt}Variance      {res} 110.2341
{txt}95%    {res}       12            120       {txt}Skewness      {res} 7.036992
{txt}99%    {res}       48            120       {txt}Kurtosis      {res} 66.92586
{txt}
{com}. replace wmconf_length1_u_ec2 = r(p95) if wmconf_length1_u_ec2 > r(p95) & !missing(wmconf_length1_u_ec2)
{txt}(28 real changes made)

{com}. 
. * Make the value for land, money, gener 
. egen lmg_conf_length_max_u_ec2 =  rowmax(conf_m_house conf_m_farm conf_m_other mnyconf_length1_u_ec2 wmconf_length1_u_ec2) 
{txt}(12125 missing values generated)

{com}. egen lmg_conf_length_mean_u_ec2 =  rowmean(conf_m_house conf_m_farm conf_m_other mnyconf_length1_u_ec2 wmconf_length1_u_ec2) 
{txt}(12125 missing values generated)

{com}. 
. gen lmg_conf_length_max_c_ec2 = lmg_conf_length_max_u_ec2 if  lmg_conf_u_ec2 == 1
{txt}(14,910 missing values generated)

{com}. gen lmg_conf_length_mean_c_ec2 = lmg_conf_length_mean_u_ec2 if  lmg_conf_u_ec2 == 1
{txt}(14,910 missing values generated)

{com}. 
. 
. 
. foreach type in house farm {c -(}
{txt}  2{com}.         
.         * Used statutory forum as last
.         gen forum_statutory_`type' = -1*forum_community_`type'+1
{txt}  3{com}.         la var forum_statutory_`type' "Used statutory forum for `count' dispute"
{txt}  4{com}.         
.         * Occupied/claimed during way
.         foreach action in occupy claim  {c -(}
{txt}  5{com}.                 encode la``type'num'`type'`action'_ec2, gen(`action'_`type') label(binary)
{txt}  6{com}.                 la var `action'_`type' "`type' `action' during war"
{txt}  7{com}.         {c )-}
{txt}  8{com}.         * Palava due to war
.         encode la``type'num'palavapostwar_ec2, gen(postwar_`type') label(binary)
{txt}  9{com}.         la var postwar_`type' "postwar `type' palava"
{txt} 10{com}. {c )-}
{txt}(16,033 missing values generated)
(16,008 missing values generated)

{com}. 
. 
. ********************************************************************************
. * Construct new variables about number of incidents ****************************
. ********************************************************************************
. gen land_dispute_times_ec2 = farmconf_u_ec2 + houseconf_u_ec2 + otherconf_u_ec2
{txt}(12,126 missing values generated)

{com}. 
. /*      Generate a new variable that is property damage + violence. 
>         This variable might already exist somewhere, but I couldn't find the name. 
> */
. 
. 
. ********************************************************************************
. * Construct variables about investment *****************************************
. ********************************************************************************
. foreach type in house farm {c -(}
{txt}  2{com}.         * Land size
.         gen size_`type' = la``type'num'`type'size_ec2
{txt}  3{com}.         replace size_`type'=la``type'num'`type'size_ec2*.25 if la``type'num'`type'unit=="3-Lots"
{txt}  4{com}.         replace size_`type'=la``type'num'`type'size_ec2*1.5 if la``type'num'`type'unit=="2-Tins of rice"
{txt}  5{com}.         replace size_`type'=la``type'num'`type'size_ec2*.75 if la``type'num'`type'unit=="4-Buckets"
{txt}  6{com}.         replace size_`type'=la``type'num'`type'size_ec2*1.5 if la``type'num'`type'unit=="5-Koon"
{txt}  7{com}.         
.         
.         la var size_`type' "Land size (acres), `type'"  
{txt}  8{com}.         qui sum size_`type', d
{txt}  9{com}.                 replace size_`type'=r(p90) if size_`type'>=r(p90) & !missing(size_`type')
{txt} 10{com}. {c )-}
{txt}(12,327 missing values generated)
(3,145 real changes made, 6 to missing)
(231 real changes made, 24 to missing)
(88 real changes made, 3 to missing)
(141 real changes made, 4 to missing)
(215 real changes made)
(12,539 missing values generated)
(155 real changes made, 8 to missing)
(654 real changes made, 42 to missing)
(90 real changes made, 7 to missing)
(8 real changes made, 4 to missing)
(357 real changes made)

{com}. 
. 
. ********************************************************************************
. * Construct variables relating to land security ********************************
. ********************************************************************************
. 
. * Locals make it easier to read the data ***************************************
. local housenum 1
{txt}
{com}. local farmnum 2
{txt}
{com}. local othernum 3
{txt}
{com}. 
. * Index of security through rights *********************************************
. foreach type in house farm {c -(}
{txt}  2{com}.         cap drop __00*
{txt}  3{com}.         * Secure boundaries
.         qui gen secured_`type' = -1*la``type'num'`type'sec_ec2 + 4
{txt}  4{com}.         la var secured_`type' "Secure boundaries, `type'"
{txt}  5{com}. 
.         * Appoint someone to inherit
.         gen inherit_`type' = -1*la``type'num'`type'inherit_ec2 + 4
{txt}  6{com}.         la var inherit_`type' "Ability to inherit, `type'"
{txt}  7{com}.         
.         * Sell land for money
.         gen sell_`type' = -1*la``type'num'`type'sell_ec2 + 4
{txt}  8{com}.         la var sell_`type' "Ability to sell, `type'"
{txt}  9{com}.         
.         * Pawn land for money
.         gen pawn_`type' = -1*la``type'num'`type'pawnfut_ec2 + 4
{txt} 10{com}.         la var pawn_`type' "Ability to pawn, `type'"
{txt} 11{com}.         
.         * Survey land
.         gen survey_`type' = -1*la``type'num'`type'svyfut_ec2 + 4
{txt} 12{com}.         la var survey_`type' "Ability to survey, `type'"
{txt} 13{com}.         
.         * Z-score
.         foreach v in secured inherit sell pawn survey {c -(}
{txt} 14{com}.                 qui sum `v'_`type' if ENDLINE2_RESIDENT==1
{txt} 15{com}.                 qui gen Z_`v' = (`v'_`type' - r(mean))/r(sd) if !missing(`v'_`type')
{txt} 16{com}.         {c )-}
{txt} 17{com}.         egen security_rights_`type' = rowtotal(Z_*), m 
{txt} 18{com}.         qui sum security_rights_`type'
{txt} 19{com}.         replace security_rights_`type' = (security_rights_`type'-r(mean))/r(sd)
{txt} 20{com}.         la var security_rights_`type' "Index of security through rights, `type'"
{txt} 21{com}.         drop Z_*
{txt} 22{com}. {c )-}
{txt}(12,288 missing values generated)
(12,288 missing values generated)
(12,287 missing values generated)
(12,287 missing values generated)
(12287 missing values generated)
(3,850 real changes made)
(12,471 missing values generated)
(12,471 missing values generated)
(12,471 missing values generated)
(12,471 missing values generated)
(12471 missing values generated)
(3,666 real changes made)

{com}. 
. * Respondent-level index across 2 measures of plots ****************************
. foreach v in house farm {c -(}
{txt}  2{com}.                 qui sum security_rights_`v' if ENDLINE2_RESIDENT==1
{txt}  3{com}.                 qui gen Z_`v' = (security_rights_`v' - r(mean))/r(sd) if !missing(security_rights_`v')
{txt}  4{com}.         {c )-}
{txt}
{com}.         egen security_rights = rowtotal(Z_*) if ENDLINE2_RESIDENT==1
{txt}(12125 missing values generated)

{com}.         qui sum security_rights
{txt}
{com}.         replace security_rights = (security_rights-r(mean))/r(sd)
{txt}(4,012 real changes made)

{com}.         la var security_rights "index of security through rights, for respondent"
{txt}
{com}.         drop Z_*
{txt}
{com}. 
. 
. ********************************************************************************
. * Construct variables relating to use of Land **********************************
. ********************************************************************************
. 
. * Index of fallow land *********************************************************
. foreach type in farm {c -(}
{txt}  2{com}.         cap drop __00*
{txt}  3{com}. 
.         * Ever let the land rest
.         gen landrestpast_`type' = la``type'num'`type'restever_ec2
{txt}  4{com}.         la var landrestpast_`type' "Ever let land rest, `type'"
{txt}  5{com}.         ** I ADDED A NEW VARIABLE: WILL LET LAND REST
.         gen landrestfut_`type' = la``type'num'`type'restfut_ec2
{txt}  6{com}.         la var landrestfut_`type' "Will let land rest in future, `type'"
{txt}  7{com}.         * Seasons to rest
.         gen restseasons_`type' = la``type'num'`type'restseasons_ec2
{txt}  8{com}.         qui replace restseasons_`type' = 0 if missing(restseasons_`type') & inlist(landrestpast_`type',0,1)
{txt}  9{com}.         la var restseasons_`type' "# of seasons to rest, `type'"
{txt} 10{com}. 
.         * No one would take
.         gen securerest_`type'=-1*la``type'num'`type'take_ec2+4
{txt} 11{com}.         la var securerest_`type' "Secure if land rested, `type'"
{txt} 12{com}. 
.         * Z-score
.         foreach v in landrestpast landrestfut restseasons securerest {c -(}
{txt} 13{com}.                 qui sum `v'_`type' if ENDLINE2_RESIDENT==1
{txt} 14{com}.                 qui gen Z_`v' = (`v'_`type' - r(mean))/r(sd) if !missing(`v'_`type')
{txt} 15{com}.         {c )-}
{txt} 16{com}.         egen fallowland_`type' = rowtotal(Z_*), m 
{txt} 17{com}.         la var fallowland_`type' "Index of fallow land, `type'"
{txt} 18{com}.         qui sum fallowland_`type'
{txt} 19{com}.         qui replace fallowland_`type' = (fallowland_`type'-r(mean))/r(sd)
{txt} 20{com}.         drop Z_*
{txt} 21{com}. {c )-}
{txt}(12,471 missing values generated)
(12,471 missing values generated)
(13,434 missing values generated)
(12,471 missing values generated)
(12471 missing values generated)

{com}. 
. ********************************************************************************
. * Construct variables related to improvement of land ***************************
. ********************************************************************************
. 
. * Investment in House **********************************************************
. 
. foreach type in house {c -(}
{txt}  2{com}.         
.         * House improvement (0-1)
.         gen improveexisting_`type' = la``type'num'`type'work_ec2
{txt}  3{com}.         la var improveexisting_`type' "Improved existing `type'"
{txt}  4{com}.         gen improvenew_`type' = la``type'num'`type'build_ec2
{txt}  5{com}.         la var improvenew_`type' "Build new `type'"
{txt}  6{com}.         
.         * Number of days
.         gen daysexisting_`type' = la``type'num'`type'workdys_ec2
{txt}  7{com}.         la var daysexisting_`type' "Days spent on existing `type'"
{txt}  8{com}.         gen daysnew_`type' = la``type'num'`type'builddys_ec2
{txt}  9{com}.         la var daysnew_`type' "Days spent on existing `type'"
{txt} 10{com}.         
.         * Money spent
.         gen spentexisting_`type' = la``type'num'`type'workmonusd_ec2
{txt} 11{com}.         la var spentexisting_`type' "USD spent on existing `type'"
{txt} 12{com}.         gen spentnew_`type' = la``type'num'`type'buildmonusd_ec2
{txt} 13{com}.         la var spentnew_`type' "USD spent on existing `type'"
{txt} 14{com}.         
.         * Impute 0 for no improvement
.         foreach v in improve days spent {c -(}
{txt} 15{com}.                 foreach suffix in existing new {c -(}
{txt} 16{com}.                         replace `v'`suffix'_`type' = 0 if la1nohousespot_ec2!=0 & missing(`v'`suffix'_`type') & ENDLINE2_RESIDENT==1
{txt} 17{com}.                 {c )-}
{txt} 18{com}.         {c )-}
{txt} 19{com}. 
. 
.         * Any improvement on house
. 
.         gen improve_`type' = 0 if ENDLINE2_RESIDENT==1 & ( !missing(improvenew_`type') | !missing(improveexisting_`type'))
{txt} 20{com}.         foreach v in improvenew improveexisting {c -(}
{txt} 21{com}.                 replace improve_`type' = 1 if `v'_`type'==1
{txt} 22{com}.         {c )-}
{txt} 23{com}.         
.         * Money
.         foreach v in spentnew spentexisting {c -(}
{txt} 24{com}.                 qui sum `v'_`type' if ENDLINE2_RESIDENT==1
{txt} 25{com}.                 qui gen Z_`v' = (`v'_`type' - r(mean))/r(sd) if !missing(`v'_`type')
{txt} 26{com}.         {c )-}
{txt} 27{com}.         
.         egen mny_`type' = rowtotal(Z_*), m 
{txt} 28{com}.         la var mny_`type' "USD `type' improvement, z-score"
{txt} 29{com}.         qui sum mny_`type'
{txt} 30{com}.         qui replace mny_`type' = (mny_`type'-r(mean))/r(sd)
{txt} 31{com}.         drop Z_*
{txt} 32{com}.         
.         * Non-money
.         foreach v in daysnew daysexisting {c -(}
{txt} 33{com}.                 qui sum `v'_`type' if ENDLINE2_RESIDENT==1
{txt} 34{com}.                 qui gen Z_`v' = (`v'_`type' - r(mean))/r(sd) if !missing(`v'_`type')
{txt} 35{com}.         {c )-}
{txt} 36{com}.         
.         egen nonmoney_`type' = rowtotal(Z_*), m 
{txt} 37{com}.         la var nonmoney_`type' "Other (non-money) `type' improvement, z-score"
{txt} 38{com}.         qui sum nonmoney_`type'
{txt} 39{com}.         qui replace nonmoney_`type' = (nonmoney_`type'-r(mean))/r(sd)
{txt} 40{com}.         drop Z_*
{txt} 41{com}. {c )-}
{txt}(12,287 missing values generated)
(12,287 missing values generated)
(15,048 missing values generated)
(15,865 missing values generated)
(15,048 missing values generated)
(15,866 missing values generated)
(0 real changes made)
(0 real changes made)
(2,761 real changes made)
(3,578 real changes made)
(2,761 real changes made)
(3,579 real changes made)
(12,287 missing values generated)
(273 real changes made)
(1,002 real changes made)
(12287 missing values generated)
(12287 missing values generated)

{com}. 
.                 
. * Investment in Farm ***********************************************************
. foreach type in farm {c -(}
{txt}  2{com}.         
.         * Farm improvement (0-1)
.         foreach c in gutter fence tree {c -(}
{txt}  3{com}.                 gen improve`c'_`type' = la``type'num'`type'`c'_ec2
{txt}  4{com}.                 la var improve`c'_`type' "Improved `c' in `type'"
{txt}  5{com}.         {c )-}
{txt}  6{com}.         
.         rename improvegutter_`type' improvegut_`type'
{txt}  7{com}.         
.         * Money spent
.         foreach c in gut fence tree {c -(}
{txt}  8{com}.                 gen spent`c'_`type' = la``type'num'`type'`c'mon_ec2
{txt}  9{com}.                 la var spent`c'_`type' "USD spent on `c' in `type'"
{txt} 10{com}.         {c )-}
{txt} 11{com}.         
.         *Acres/number of benefited land/trees
.         foreach c in gut {c -(}
{txt} 12{com}.                 gen acres`c'_`type' = la``type'num'`type'`c'land_ec2
{txt} 13{com}.                 la var acres`c'_`type' "Acres affected, `c' in `type'"
{txt} 14{com}.         {c )-}
{txt} 15{com}.         
.         foreach c in fence {c -(}
{txt} 16{com}.                 gen acres`c'_`type' = la``type'num'`type'`c'bound_ec2
{txt} 17{com}.                 la var acres`c'_`type' "`c' put up in `type'"
{txt} 18{com}.         {c )-}
{txt} 19{com}.         
.         foreach c in tree {c -(}
{txt} 20{com}.                 gen acres`c'_`type' = la``type'num'`type'`c'amt_ec2
{txt} 21{com}.                 la var acres`c'_`type' "`c' planted in `type'"
{txt} 22{com}.         {c )-}
{txt} 23{com}.         
.         
.         * Impute 0 for no improvement
.         foreach v in improve spent acres {c -(}
{txt} 24{com}.                 foreach suffix in gut fence tree {c -(}
{txt} 25{com}.                         replace `v'`suffix'_`type' = 0 if la``type'num'`type'size_ec2!=0 & missing(`v'`suffix'_`type') & ENDLINE2_RESIDENT==1
{txt} 26{com}.                 {c )-}
{txt} 27{com}.         {c )-}
{txt} 28{com}.         
.         gen improve_`type' = 0 if ENDLINE2_RESIDENT==1 & (!missing(improvegut_`type')|!missing(improvefence_`type') | !missing(improvetree_`type'))
{txt} 29{com}.         foreach v in improvegut improvefence improvetree {c -(}
{txt} 30{com}.                 replace improve_`type' = 1 if `v'_`type'==1
{txt} 31{com}.         {c )-}
{txt} 32{com}. 
.         
.         * Money
.         foreach v in spentgut spentfence spenttree {c -(}
{txt} 33{com}.                 qui sum `v'_`type' if ENDLINE2_RESIDENT==1
{txt} 34{com}.                 qui gen Z_`v' = (`v'_`type' - r(mean))/r(sd) if !missing(`v'_`type')
{txt} 35{com}.         {c )-}
{txt} 36{com}.         
.         egen mny_`type' = rowtotal(Z_*), m 
{txt} 37{com}.         la var mny_`type' "USD `type' improvement, z-score"
{txt} 38{com}.         qui sum mny_`type'
{txt} 39{com}.         qui replace mny_`type' = (mny_`type'-r(mean))/r(sd)
{txt} 40{com}.         drop Z_*
{txt} 41{com}.         
.         * Non-money
.         
.         foreach v in acresgut acresfence acrestree {c -(}
{txt} 42{com}.                 qui sum `v'_`type' if ENDLINE2_RESIDENT==1
{txt} 43{com}.                 qui gen Z_`v' = (`v'_`type' - r(mean))/r(sd) if !missing(`v'_`type')
{txt} 44{com}.         {c )-}
{txt} 45{com}.         egen nonmoney_`type' = rowtotal(Z_*), m 
{txt} 46{com}.         la var nonmoney_`type' "Other (non-money) `type' improvement, z-score"
{txt} 47{com}.         qui sum nonmoney_`type'
{txt} 48{com}.         qui replace nonmoney_`type' = (nonmoney_`type'-r(mean))/r(sd)
{txt} 49{com}.         drop Z_*
{txt} 50{com}. {c )-}
{txt}(12,471 missing values generated)
(12,471 missing values generated)
(12,471 missing values generated)
{res}{txt}(15,930 missing values generated)
(15,582 missing values generated)
(15,058 missing values generated)
(15,931 missing values generated)
(15,582 missing values generated)
(15,063 missing values generated)
(346 real changes made)
(346 real changes made)
(346 real changes made)
(3,771 real changes made)
(3,428 real changes made)
(2,918 real changes made)
(3,772 real changes made)
(3,428 real changes made)
(2,923 real changes made)
(12,125 missing values generated)
(207 real changes made)
(472 real changes made)
(801 real changes made)
(12138 missing values generated)
(12138 missing values generated)

{com}. 
. * Overall land improvement (house and farm) ************************************        
. foreach type in house farm {c -(}
{txt}  2{com}.         foreach v in improve mny nonmoney {c -(}
{txt}  3{com}.                         qui sum `v'_`type' if ENDLINE2_RESIDENT==1
{txt}  4{com}.                         qui gen Z_`v' = (`v'_`type' - r(mean))/r(sd) if !missing(`v'_`type')
{txt}  5{com}.                 {c )-}
{txt}  6{com}.                 egen improvez_`type' = rowtotal(Z_*), m 
{txt}  7{com}.                 la var improvez_`type' "All `type' improvement, z-score"
{txt}  8{com}.                 qui sum improvez_`type'
{txt}  9{com}.                 qui replace improvez_`type' = (improvez_`type'-r(mean))/r(sd)
{txt} 10{com}.                 drop Z_*
{txt} 11{com}. {c )-}
{txt}(12287 missing values generated)
(12125 missing values generated)

{com}. 
. 
. * Repondent level improvement index ********************************************
. foreach v in house farm {c -(}
{txt}  2{com}.                 qui sum improvez_`v' if ENDLINE2_RESIDENT==1
{txt}  3{com}.                 qui gen Z_`v' = (improvez_`v' - r(mean))/r(sd) if !missing(improvez_`v')
{txt}  4{com}.         {c )-}
{txt}
{com}.         egen improvez = rowtotal(Z_*) if ENDLINE2_RESIDENT==1
{txt}(12125 missing values generated)

{com}.         qui sum improvez
{txt}
{com}.         replace improvez = (improvez-r(mean))/r(sd)
{txt}(4,012 real changes made)

{com}.         la var improvez "Index of improvement, for respondent"
{txt}
{com}.         drop Z_*
{txt}
{com}.         
. 
. ********************************************************************************
. * Construct variables on years of ownershipt and strength of ownership *********
. ********************************************************************************
. 
. * Years of ownership ***********************************************************
. local num_house 1
{txt}
{com}. local num_farm 2
{txt}
{com}. 
. foreach type in house farm {c -(}
{txt}  2{com}.         
.         gen ownyrs_`type' = la`num_`type''`type'yrs_ec2
{txt}  3{com}.         replace ownyrs_`type' = 0 if la`num_`type''`type'yrs_ec2<0 
{txt}  4{com}.         
.         qui sum ownyrs_`type', d
{txt}  5{com}.         replace ownyrs_`type' = r(p95) if ownyrs_`type'>r(p95) & !missing(ownyrs_`type')
{txt}  6{com}. {c )-}
{txt}(12,303 missing values generated)
(0 real changes made)
(110 real changes made)
(12,490 missing values generated)
(0 real changes made)
(178 real changes made)

{com}. 
. * How did they get the farm? ***************************************************
. local num_house 1
{txt}
{com}. local num_farm 2
{txt}
{com}. 
. foreach g in house farm {c -(}
{txt}  2{com}. 
.         gen `g'_inherit = inlist(la`num_`g''`g'access, 1)
{txt}  3{com}.         gen `g'_request = inrange(la`num_`g''`g'access, 2,5)
{txt}  4{com}.         gen `g'_buyrent = inrange(la`num_`g''`g'access, 6,9)
{txt}  5{com}.         gen `g'_squat = inlist(la`num_`g''`g'access, 10)
{txt}  6{com}.         
.         gen distenure_`g' = `g'_request ==1 | `g'_squat==1
{txt}  7{com}.         gen markettenure_`g' = `g'_request != 1 & `g'_squat!=1
{txt}  8{com}. {c )-}
{txt}
{com}. 
. * Who owns the farm? ***********************************************************
. local num_house 1
{txt}
{com}. local num_farm 2
{txt}
{com}. 
. foreach g in house farm {c -(}
{txt}  2{com}. 
.         gen `g'_me = la`num_`g''`g'own== 1
{txt}  3{com}.         gen `g'_family = la`num_`g''`g'own== 2
{txt}  4{com}.         gen `g'_extendfamily = la`num_`g''`g'own == 3
{txt}  5{com}.         gen `g'_opersonsame = la`num_`g''`g'own == 4
{txt}  6{com}.         gen `g'_opersondiff = la`num_`g''`g'own == 5
{txt}  7{com}.         gen `g'_own = `g'_me==1
{txt}  8{com}.         gen `g'_notown = `g'_me!=1
{txt}  9{com}.         
.         gen self_`g' = `g'_me==1 
{txt} 10{com}.         gen selffam_`g' = `g'_me==1 | `g'_family==1
{txt} 11{com}.         gen nonkin_`g' = `g'_opersonsame==1 | `g'_opersondiff==1
{txt} 12{com}. {c )-}
{txt}
{com}. 
. 
. ********************************************************************************
. * Impute unresolved gender fights **********************************************
. ********************************************************************************
. /*      Don't know why this is all the way down here. 
> */
. replace wmconf_unrslv_u_ec2 = 0 if missing(wmconf_unrslv_u_ec2) & ENDLINE2_RESIDENT==1
{txt}(168 real changes made)

{com}. 
. 
. ********************************************************************************
. * small cleanings for the Endline 1 analysis ***********************************
. ********************************************************************************
. /*      We also report endline 1 effects in a few tables. So we have to make a few
>         adjustments to get those to work. 
> */ 
.         // % of town implemented for use in spillover analysis 
.         gen resident_e1 =       cond(TARGETED_RESIDENT==1 | ENDLINE_RESIDENT==1,1,0)
{txt}
{com}. 
. ********************************************************************************
. /*      Make a small correction to the districts for the 4 observations of leaders
>         without a baseline district value. 
> */      
.         replace district_bl = 4 if (ENDLINE2_LEADER == 1 & missing(district_bl))
{txt}(4 real changes made)

{com}.         tab district_bl, gen(district_ec)

              {txt}Demo: District {c |}      Freq.     Percent        Cum.
{hline 29}{c +}{hline 35}
              Foyah District {c |}{res}      1,299        8.07        8.07
{txt}            Gbarzon District {c |}{res}      1,160        7.20       15.27
{txt}          Gbehlageh District {c |}{res}      1,309        8.13       23.40
{txt}            Kolahun District {c |}{res}      1,159        7.20       30.59
{txt}             Konobo District {c |}{res}        883        5.48       36.08
{txt}           Saclepea District {c |}{res}      1,202        7.46       43.54
{txt}            Salayea District {c |}{res}        487        3.02       46.57
{txt}  Sanniquelleh-Mahn District {c |}{res}      1,515        9.41       55.97
{txt}            Tappita District {c |}{res}        991        6.15       62.13
{txt}             Tchien District {c |}{res}      1,270        7.89       70.01
{txt}              Vahun District {c |}{res}        238        1.48       71.49
{txt}           Voinjama District {c |}{res}      1,897       11.78       83.27
{txt}Yarwein-Mehnsohnneh District {c |}{res}        697        4.33       87.60
{txt}             Zoegeh District {c |}{res}        790        4.91       92.50
{txt}             Zorzor District {c |}{res}      1,207        7.50      100.00
{txt}{hline 29}{c +}{hline 35}
                       Total {c |}{res}     16,104      100.00
{txt}
{com}. 
. 
. 
. 
. 
. 
.         gen lndconf = anylndconf_alt2_ec
{txt}(11,336 missing values generated)

{com}.         gen mny_unrslv_conf = unrslv_mny_conf_ec
{txt}(11,336 missing values generated)

{com}.         gen lnd_unrslv_conf = unrslv_lnd_conf_ec
{txt}(11,336 missing values generated)

{com}.         gen mny_rslv_conf= rslv_money_conf_ec
{txt}(15,490 missing values generated)

{com}.         gen lnd_rslv_conf = rslv_lnd_conf_ec
{txt}(15,084 missing values generated)

{com}.         gen mny_rslv_infrml = rslv_money_infrml_ec
{txt}(15,490 missing values generated)

{com}.         gen lnd_rslv_infrml = rslv_lnd_conf_infrml_ec
{txt}(15,082 missing values generated)

{com}.         gen mny_stsfd = mnyresfair_ec
{txt}(15,490 missing values generated)

{com}.         gen lnd_stsfd = satisfied_res_ec
{txt}(15,082 missing values generated)

{com}. 
.         replace lndconf = anylndconf_alt2_et if TARGETED_RESIDENT == 1
{txt}(634 real changes made)

{com}.         replace mny_unrslv_conf = unrslv_mny_conf_et if TARGETED_RESIDENT == 1
{txt}(634 real changes made)

{com}.         replace lnd_unrslv_conf = unrslv_lnd_conf_et if TARGETED_RESIDENT == 1
{txt}(634 real changes made)

{com}.         replace mny_rslv_conf= rslv_money_conf_et if TARGETED_RESIDENT == 1
{txt}(74 real changes made)

{com}.         replace lnd_rslv_conf = rslv_lnd_conf_et if TARGETED_RESIDENT == 1
{txt}(156 real changes made)

{com}.         replace mny_rslv_infrml = rslv_money_infrml_et if TARGETED_RESIDENT == 1
{txt}(74 real changes made)

{com}.         replace lnd_rslv_infrml = rslv_lnd_conf_infrml_et if TARGETED_RESIDENT == 1
{txt}(157 real changes made)

{com}.         replace mny_stsfd = mnyresfair_et if TARGETED_RESIDENT == 1
{txt}(74 real changes made)

{com}.         replace lnd_stsfd = satisfied_res_et if TARGETED_RESIDENT == 1
{txt}(157 real changes made)

{com}. 
.         
.         foreach var in conf _unrslv_conf  _rslv_conf _rslv_infrml _stsfd {c -(}
{txt}  2{com}.                 * L+M+G
.                 egen lm`var' = rowmax(lnd`var' mny`var') if !missing(lnd`var') | !missing(mny`var')
{txt}  3{com}.                 la var lm`var' "`var', land and money disputes"
{txt}  4{com}.                 
.         {c )-}
{txt}(6691 missing values generated)
(10702 missing values generated)
(14467 missing values generated)
(14466 missing values generated)
(14466 missing values generated)

{com}.         
.         gen sevlandconf_dummy_c_ec = sevlandconf_dummy_ec if anylndconf_alt2_ec==1 & resident_e1 == 1
{txt}(15,082 missing values generated)

{com}.         gen sevlandconf_dummy_c_et = sevlandconf_dummy_et if anylndconf_alt2_et==1 & resident_e1 == 1
{txt}(15,980 missing values generated)

{com}. 
. 
. // Small community dummies by quartile
.                 
.         xtile quart_e1 = ctownpop_el if ENDLINE_LEADER==1 | ENDLINE_RESIDENT==1 | TARGETED_RESIDENT==1 | COMMLEVEL==1, nq(4) 
{txt}
{com}.         
.         gen vsmall_e1 = (commcode==1050 | commcode==1312 | commcode==2290 | commcode==2850)
{txt}
{com}.         
.         gen small_e1 = (quart_e1==1) if quart_e1!=.
{txt}(9,626 missing values generated)

{com}.                 
.         gen small2_e1 = (quart_e1==2) if quart_e1!=.
{txt}(9,626 missing values generated)

{com}.         
.         gen small3_e1 = (quart_e1==3) if quart_e1!=.
{txt}(9,626 missing values generated)

{com}. 
.         gen small4_e1 = (quart_e1==4) if quart_e1!=.
{txt}(9,626 missing values generated)

{com}.                                 
.         drop quart_e1
{txt}
{com}. 
.         replace vsmall  = vsmall_e1     if ENDLINE_LEADER==1 | ENDLINE_RESIDENT==1 | TARGETED_RESIDENT==1 | COMMLEVEL==1
{txt}(0 real changes made)

{com}.         replace small   = small_e1      if ENDLINE_LEADER==1 | ENDLINE_RESIDENT==1 | TARGETED_RESIDENT==1 | COMMLEVEL==1
{txt}(6,323 real changes made)

{com}.         replace small2  = small2_e1     if ENDLINE_LEADER==1 | ENDLINE_RESIDENT==1 | TARGETED_RESIDENT==1 | COMMLEVEL==1
{txt}(6,348 real changes made)

{com}.         replace small3  = small3_e1     if ENDLINE_LEADER==1 | ENDLINE_RESIDENT==1 | TARGETED_RESIDENT==1 | COMMLEVEL==1
{txt}(6,349 real changes made)

{com}.         replace small4  = small4_e1     if ENDLINE_LEADER==1 | ENDLINE_RESIDENT==1 | TARGETED_RESIDENT==1 | COMMLEVEL==1
{txt}(6,330 real changes made)

{com}. 
. 
. 
. 
.         
. 
. /*      This next section renames variables so that they match the observation they 
>         correspond to. For example, anylndconf_alt2 has values for both residents and 
>         targeted residents. So they create new variables full of misisng values. 
> 
>         I did not write this! This set of code is horrible and qualifies as "worst 
>         practices". But I was a afraid to change this giant block for fear of something 
>         not working. 
> */
. foreach x in anylndconf_alt2 unrslv_lnd_conf propdest_landconf viol_landconf threat_landconf conflictwith_fam conflictwith_neigh conflictwith_strgr /// 
>         conflictwith_oth rslv_lnd_conf satisfied_res rslv_lnd_conf_infrml rslv_lnd_conf_cust rslv_lnd_conf_frml rslv_lnd_conf_adm rslv_lnd_conf_oth rslv_lnd_conf_none /// 
>         conflictover_boundary conflictover_inher conflictover_use conflictover_other landconf_propdest landconf_confviol landconf_threatviol mnyconf unrslv_money_conf /// 
>         moneyconflict_fam moneyconflict_neigh moneyconflict_strgr moneyconflict_oth rslv_money_conf mnyresfair rslv_money_infrml rslv_money_cust rslv_money_frml rslv_money_adm ///
>         rslv_money_oth rslv_money_none anylndconf_alt2 unrslv_lnd_conf propdest_landconf viol_landconf threat_landconf rslv_lnd_conf rslv_lnd_conf_infrml  ///
>         satisfied_res anylndconf_alt2 unrslv_lnd_conf propdest_landconf satisfied_res log_farm_size business_land tree_assets hhqual_index /// 
>         land_fiveyrs mnyconf unrslv_mny_conf rslv_money_conf rslv_money_infrml mnyresfair fights_dummy fightweap_dummy tribviol_el strkviol_el /// 
>         youthelder_el strkpeac_el interfamlanddisp_el confothtown_el witchkilling_el sasycutl_el sasywitch_el magcourt1_court assertiveprogram_alt ///
>         prgrsv_attitudes3 diffdiff_res_e confsolve_res_e nolike_res_e age male yrs_edu notbornintown excom disp_ref viol_experienced lndtake_dum /// 
>         housetake_dum land_size noland secure_farm trainee conflictover_boundary_v2 conflictover_inher_v2 conflictover_use_v2 conflictover_other_v2 unrslv_lnd_over_boundary /// 
>         unrslv_lnd_over_inher unrslv_lnd_over_use unrslv_lnd_over_other landconf_threatviol_v2 landconf_propdest_v2 landconf_confviol_v2 anylndconf_alt2 propdest_landconf ///
>         viol_landconf threat_landconf sevlandconf_dummy unrslv_lnd_conf viol_landconf_dummy landconf_propdest landconf_confviol landconf_threatviol rslv_lnd_conf rslv_lnd_conf_infrml ///
>         satisfied_res sprog_gendbeliefs smnrty_landbeliefs sno_ethnic_bias_alt intermarriage land_resolution_type money_resolution_type ///
>         $ate_ctrls $ate_ctrls_l $comm_ctrls age land_size farm_size cashearn_imputed displa_rfugem      /// 
>         jpc_attend minority under30 prgrsv_attitudes jpc_attend_risk_ls minortribe_assigned jpc_attend_highrisk_ls      /// 
>         money_resolution_type displaced refugee land_resolution_type viol_experienced   ///
>         housetake_dum lndtake_dum lndhousetake_dum log_land_size log_farm_size land_size displa_rfugem landless ///
>         farm_size farmless propdest_landconf viol_landconf threat_landconf ///
>         female stranger ageover60 age40_60 age20_40 under30 wealthindex chiefrel_dup minority minortribe {c -(}
{txt}  2{com}. 
.                         cap local lbl: variable label `x'               
{txt}  3{com}.                         cap local lbl: variable label `x'_et            
{txt}  4{com}.                         cap local lbl: variable label `x'_ec            
{txt}  5{com}.                         cap gen `x'=`x'_et if TARGETED_RESIDENT==1
{txt}  6{com}.                         cap gen `x'=`x'_ec if ENDLINE_RESIDENT==1
{txt}  7{com}.                         cap replace `x'=`x'_ec if ENDLINE_RESIDENT==1
{txt}  8{com}.                         cap replace `x'=`x'_el if ENDLINE_LEADER==1 // LEADERS DONT HAVE ALL VARS THAT TRAINEES AND CITIZENS DO
{txt}  9{com}.                         cap la var `x' "`lbl'"
{txt} 10{com}.         {c )-}
{txt}
{com}. 
. 
. /*      Add Endline 1 observations for some key Endline 2 outcome variables. This 
>         will allow us to make a table with ITT estimates for both E1 and E2 at the
>         same time. The link betweeen E1 variable and E2 variable was found using 
>         the "Table - t2" excel table in the "output_excel" folder. I replace missing
>         for some variables that we don't have any data on in Endline 1. Making sure
>         that everything is missing for resident_e1 observations will  be crucual
>         to making the table work.  
> 
> 
>         Yes, adding the "_ec2" suffixes is confusing, since no other E1 data will 
>         have that suffix. However they should never have had different names in 
>         the first place. I am okay introducing this messiness. 
> */
. 
. replace anylndconf_u_ec2                =       anylndconf_alt2_ec                      if (ENDLINE_RESIDENT == 1)
{txt}(4,801 real changes made)

{com}. replace unrslv_lnd_conf_u_ec2   =       unrslv_lnd_conf_ec                      if (ENDLINE_RESIDENT == 1)
{txt}(4,801 real changes made)

{com}. replace conf_any_u_ec2                  =       sevlandconf_dummy_ec            if (ENDLINE_RESIDENT == 1)
{txt}(4,801 real changes made)

{com}. replace conf_threat_u_ec2               =       threat_landconf_ec                      if (ENDLINE_RESIDENT == 1)
{txt}(4,801 real changes made)

{com}. replace conf_damage_u_ec2               =       propdest_landconf_ec            if (ENDLINE_RESIDENT == 1)
{txt}(4,801 real changes made)

{com}. replace conf_viol_u_ec2                 =       viol_landconf_ec                        if (ENDLINE_RESIDENT == 1)
{txt}(4,801 real changes made)

{com}. replace conf_witch_u_ec2                =       .                                                       if (ENDLINE_RESIDENT == 1)
{txt}(0 real changes made)

{com}. replace conf_any_c_ec2                  =       sevlandconf_dummy_c_ec          if (ENDLINE_RESIDENT == 1)
{txt}(1,055 real changes made)

{com}. replace forum_lastsuc_c_ec2             =       rslv_lnd_conf_ec                        if (ENDLINE_RESIDENT == 1)
{txt}(1,053 real changes made)

{com}. replace conf_forum_c_ec2                =       .                                                       if (ENDLINE_RESIDENT == 1)
{txt}(0 real changes made)

{com}. replace forum_inf_suc_c_ec2             =       rslv_lnd_conf_infrml_ec         if (ENDLINE_RESIDENT == 1)
{txt}(1,055 real changes made)

{com}. replace forum_lastsat_c_ec2             =       satisfied_res_ec                        if (ENDLINE_RESIDENT == 1)
{txt}(1,055 real changes made)

{com}. replace conf_any_c_ec2                  =       sevlandconf_dummy_c_ec          if (ENDLINE_RESIDENT == 1)
{txt}(0 real changes made)

{com}. replace conf_threat_c_ec2               =       threat_landconf_ec                      if (ENDLINE_RESIDENT == 1 & anylndconf_u_ec2 == 1)
{txt}(1,055 real changes made)

{com}. replace conf_damage_c_ec2               =       propdest_landconf_ec            if (ENDLINE_RESIDENT == 1 & anylndconf_u_ec2 == 1)
{txt}(1,055 real changes made)

{com}. replace conf_viol_c_ec2                 =       viol_landconf_ec                        if (ENDLINE_RESIDENT == 1 & anylndconf_u_ec2 == 1)
{txt}(1,055 real changes made)

{com}. replace conf_witch_c_ec2                =       .                                                       if (ENDLINE_RESIDENT == 1 & anylndconf_u_ec2 == 1)
{txt}(0 real changes made)

{com}. 
. 
. 
. replace anylndconf_u_ec2                =       anylndconf_alt2_et                      if (TARGETED_RESIDENT == 1)
{txt}(634 real changes made)

{com}. replace forum_lastsuc_c_ec2             =       rslv_lnd_conf_et                        if (TARGETED_RESIDENT == 1) 
{txt}(156 real changes made)

{com}. replace anylndconf_u_ec2                =       anylndconf_alt2_et                      if (TARGETED_RESIDENT == 1)
{txt}(0 real changes made)

{com}. replace unrslv_lnd_conf_u_ec2   =       unrslv_lnd_conf_et                      if (TARGETED_RESIDENT == 1)
{txt}(634 real changes made)

{com}. replace conf_m_house                    =       .                                                       if (TARGETED_RESIDENT == 1)
{txt}(0 real changes made)

{com}. replace conf_any_u_ec2                  =       sevlandconf_dummy_et            if (TARGETED_RESIDENT == 1)
{txt}(634 real changes made)

{com}. replace conf_threat_u_ec2               =       threat_landconf_et                      if (TARGETED_RESIDENT == 1)
{txt}(634 real changes made)

{com}. replace conf_damage_u_ec2               =       propdest_landconf_et            if (TARGETED_RESIDENT == 1)
{txt}(634 real changes made)

{com}. replace conf_viol_u_ec2                 =       viol_landconf_et                        if (TARGETED_RESIDENT == 1)
{txt}(634 real changes made)

{com}. replace conf_witch_u_ec2                =       .                                                       if (TARGETED_RESIDENT == 1)
{txt}(0 real changes made)

{com}. replace conf_any_c_ec2                  =       sevlandconf_dummy_c_et          if (TARGETED_RESIDENT == 1)
{txt}(157 real changes made)

{com}. replace forum_lastsuc_c_ec2             =       rslv_lnd_conf_et                        if (TARGETED_RESIDENT == 1)
{txt}(0 real changes made)

{com}. replace conf_forum_c_ec2                =       .                                                       if (TARGETED_RESIDENT == 1)
{txt}(0 real changes made)

{com}. replace forum_inf_suc_c_ec2             =       rslv_lnd_conf_infrml_et         if (TARGETED_RESIDENT == 1)
{txt}(157 real changes made)

{com}. replace forum_lastsat_c_ec2             =       satisfied_res_et                        if (TARGETED_RESIDENT == 1)
{txt}(157 real changes made)

{com}. 
. replace conf_any_c_ec2                  =       sevlandconf_dummy_c_et          if (TARGETED_RESIDENT == 1)
{txt}(0 real changes made)

{com}. replace conf_threat_c_ec2               =       threat_landconf_et                      if (TARGETED_RESIDENT == 1 & anylndconf_u_ec2 == 1)
{txt}(157 real changes made)

{com}. replace conf_damage_c_ec2               =       propdest_landconf_et            if (TARGETED_RESIDENT == 1 & anylndconf_u_ec2 == 1)
{txt}(157 real changes made)

{com}. replace conf_viol_c_ec2                 =       viol_landconf_et                        if (TARGETED_RESIDENT == 1 & anylndconf_u_ec2 == 1)
{txt}(157 real changes made)

{com}. replace conf_witch_c_ec2                =       .                                                       if (TARGETED_RESIDENT == 1 & anylndconf_u_ec2 == 1)
{txt}(0 real changes made)

{com}. /*      The previous cleaning code does this replacement. I am not sure why. They 
>         call these "erroneously missing values."
> 
>         Obviously, this is really bad, since we are imputing the value to our 
>         outcome variable that would show the program working. Take note, though, 
>         that the Endline 1 results have alrady been published at the time of me 
>         writing this. This imputation only applied to Endline 1 data. 
> */
. replace forum_lastsuc_c_ec2 = 1 if(missing(forum_lastsuc_c_ec2) &!missing(conf_any_c_ec2) & (ENDLINE_RESIDENT == 1 | TARGETED_RESIDENT == 1))
{txt}(3 real changes made)

{com}. 
. 
. /*      Notice lmg_conf_any_u_ec2 and lmg_conf_any_c_ec2 
>         Since we didn't ask about violence at for non-land disputes at Endline 1, we 
>         Just use the same variables as above. As in we pretend that land-money
>         is just land.   
> */
. 
. 
. 
. replace         mnyconf_u_ec2                   =       mnyconf_ec                              if (ENDLINE_RESIDENT == 1 | TARGETED_RESIDENT == 1)
{txt}(4,801 real changes made)

{com}. 
. replace         lmg_conf_u_ec2                  =       lmconf                                  if (ENDLINE_RESIDENT == 1 | TARGETED_RESIDENT == 1)
{txt}(5,435 real changes made)

{com}. replace         lmg_unrslv_conf_u_ec2   =       lm_unrslv_conf                  if (ENDLINE_RESIDENT == 1 | TARGETED_RESIDENT == 1)
{txt}(5,435 real changes made)

{com}. 
. 
. replace         lmg_forum_lastsuc_c_ec2 =       lm_rslv_conf                    if (ENDLINE_RESIDENT == 1 | TARGETED_RESIDENT == 1)
{txt}(1,670 real changes made)

{com}. replace         lmg_conf_forum_c_ec2    =       .                                               if (ENDLINE_RESIDENT == 1 | TARGETED_RESIDENT == 1)
{txt}(0 real changes made)

{com}. replace         lmg_forum_inf_suc_c_ec2 =       lm_rslv_infrml                  if (ENDLINE_RESIDENT == 1 | TARGETED_RESIDENT == 1)
{txt}(1,671 real changes made)

{com}. replace         lmg_forum_lastsat_c_ec2 =       lm_stsfd                                if (ENDLINE_RESIDENT == 1 | TARGETED_RESIDENT == 1)
{txt}(1,671 real changes made)

{com}. 
. /*
> replace         lmg_conf_u_ec2                  =       lmconf                                  if (resident_e1 == 1)
> replace         lmg_unrslv_conf_u_ec2   =       lm_unrslv_conf_et               if (resident_e1 == 1)
> replace         lmg_conf_m                              =       .                                               if (resident_e1 == 1)
> replace         lmg_conf_any_u_ec2              =       sevlandconf_dummy_et    if (resident_e1 == 1)
> replace         lmg_conf_any_c_ec2              =       sevlandconf_dummy_c_et  if (resident_e1 == 1)
> replace         lmg_forum_lastsuc_c_ec2 =       lm_rslv_conf_et                 if (resident_e1 == 1)
> replace         lmg_conf_forum_c_ec2    =       .                                               if (resident_e1 == 1)
> replace         lmg_forum_inf_suc_c_ec2 =       lm_rslv_infrml_et               if (resident_e1 == 1)
> replace         lmg_forum_lastsat_c_ec2 =       lm_stsfd_et                             if (resident_e1 == 1)
> */
. 
. ********************************************************************************
. * Make variable for money disputes + land disputes *****************************
. ********************************************************************************
. // the _ec2 suffix is just a convention here. It includes e1 data as well. 
. gen lmg_conf_times_ec2 = mnyconf_ec2 + anylndconf_u_ec2 if ENDLINE_RESIDENT == 1
{txt}(16,137 missing values generated)

{com}. replace lmg_conf_times_ec2 = mnyconf_ec2 + anylndconf_u_ec2 + wmconf_ec2 if ENDLINE2_RESIDENT == 1
{txt}(4,010 real changes made)

{com}. 
. 
. gen conf_dam_violence = conf_damage_u_ec2 + conf_viol_u_ec2
{txt}(6,690 missing values generated)

{com}. label var conf_dam_violence "\quad Property damage + violence (land)"
{txt}
{com}. 
. gen conf_dam_violence_threat = conf_damage_u_ec2 + conf_viol_u_ec2 + conf_threat_u_ec2
{txt}(6,690 missing values generated)

{com}. label var conf_dam_violence_threat "\quad Threats + property damage + violence (land)"
{txt}
{com}. 
. egen conf_dam_violence_bin_u = rowmax(conf_damage_u_ec2 conf_viol_u_ec2)
{txt}(6690 missing values generated)

{com}. label var conf_dam_violence_bin_u "\quad Property damage or violence in land dispute"
{txt}
{com}. 
. gen conf_dam_violence_bin_c = conf_dam_violence_bin_u if anylndconf_u_ec2 == 1
{txt}(14,572 missing values generated)

{com}. label var conf_dam_violence_bin_c "\quad Property damage or violence \tab"
{txt}
{com}. 
. 
. gen lmg_conf_dam_violence = lmg_conf_damage_u_ec2 + lmg_conf_viol_u_ec2
{txt}(12,125 missing values generated)

{com}. label var conf_dam_violence "\quad Property damage + violence (land)"
{txt}
{com}. 
. gen lmg_conf_dam_violence_threat = lmg_conf_damage_u_ec2 + lmg_conf_viol_u_ec2 + lmg_conf_threat_u_ec2
{txt}(12,125 missing values generated)

{com}. label var conf_dam_violence_threat "\quad Threats + property damage + violence (land)"
{txt}
{com}. 
. egen lmg_conf_dam_violence_bin_u = rowmax(lmg_conf_damage_u_ec2 lmg_conf_viol_u_ec2)
{txt}(12125 missing values generated)

{com}. label var lmg_conf_dam_violence_bin_u "\quad Property damage or violence in a land dispute"
{txt}
{com}. 
. gen lmg_conf_dam_violence_bin_c = lmg_conf_dam_violence_bin_u if lmg_conf_u_ec2 == 1
{txt}(14,910 missing values generated)

{com}. label var lmg_conf_dam_violence_bin_c "\quad Property damage or violence"
{txt}
{com}. 
. 
. gen lmg_conf_threat_c_ec2 = lmg_conf_threat_u_ec2 if lmg_conf_u_ec2 == 1
{txt}(14,910 missing values generated)

{com}.         label var lmg_conf_threat_c_ec2 "\quad  Threats"
{txt}
{com}. 
. gen lmg_conf_viol_c_ec2 = lmg_conf_viol_u_ec2 if lmg_conf_u_ec2 == 1
{txt}(14,910 missing values generated)

{com}.         label var lmg_conf_viol_c_ec2 "\quad Violence"
{txt}
{com}. 
. gen lmg_conf_damage_c_ec2 = lmg_conf_damage_u_ec2 if lmg_conf_u_ec2 == 1
{txt}(14,910 missing values generated)

{com}.         label var lmg_conf_damage_c_ec2 "\quad Property damage"
{txt}
{com}. 
. gen lmg_conf_witch_c_ec2 = lmg_conf_witch_u_ec2 if lmg_conf_u_ec2 == 1
{txt}(14,910 missing values generated)

{com}.         label var lmg_conf_witch_c_ec2 "\quad Witchcraft \quad"
{txt}
{com}. 
. 
. ********************************************************************************
. * Repeat the same process for community level violence variables ***************
. ********************************************************************************
.                         
.                 // Indicators for community-level disputes
.                 
.                 gen youthelder_el = cond(pvytheld_el>0 & pvytheld_el!=.,1,0) if ENDLINE_LEADER==1
{txt}(15,197 missing values generated)

{com}.                         label var youthelder_el "Indicator: Any youth-elder disputes"                           
{txt}
{com}.                 
.                 gen interfamlanddisp_el = cond(famlndcn_el>0 & famlndcn_el!=.,1,0) if ENDLINE_LEADER==1
{txt}(15,197 missing values generated)

{com}.                         label var interfamlanddisp_el "Indicator: Any inter-family landdisputes"                                
{txt}
{com}. 
.                 gen confothtown_el = cond(dtwnldcn_el>0 & dtwnldcn_el!=.,1,0) if ENDLINE_LEADER==1
{txt}(15,197 missing values generated)

{com}.                         label var confothtown_el "Indicator: Any conflicts with other towns disputes"                           
{txt}
{com}.                         
.                 foreach y in tribviol_el strkviol_el strkpeac_el sasycutl_el witchkilling_el sasywitch_el {c -(}
{txt}  2{com}.                         replace `y'=0 if `y'==. & ENDLINE_LEADER==1
{txt}  3{com}.                         {c )-}
{txt}(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)

{com}.                         
.                         
. // 4.4 TREATMENT INTERACTIONS  -- VARIABLES MISSING NEED TO CHECK THIS
. 
.         foreach y in displ_or_refugee lndhousetake_dum viol_experienced female under30 minority twn_ldr minrty_ldr wmn_ldr yth_ldr oth_ldr eldr_ldr {c -(}
{txt}  2{com}.                 gen assigned_`y'_`x'=`y'*assigned_ever
{txt}  3{com}.                 gen treated_`y'_`x'=`y'*treated_ever
{txt}  4{com}.                 {c )-}
{txt}(10,702 missing values generated)
(10,702 missing values generated)
(10,726 missing values generated)
(10,726 missing values generated)
(4,779 missing values generated)
(4,779 missing values generated)
(5,719 missing values generated)
(5,719 missing values generated)
(4,780 missing values generated)
(4,780 missing values generated)
(15,197 missing values generated)
(15,197 missing values generated)
(15,197 missing values generated)
(15,197 missing values generated)
(15,197 missing values generated)
(15,197 missing values generated)
(15,197 missing values generated)
(15,197 missing values generated)
(15,197 missing values generated)
(15,197 missing values generated)
(15,197 missing values generated)
(15,197 missing values generated)

{com}. 
.  egen anyviol_el = rowmax(tribviol_el strkviol_el youthelder_el strkpeac_el interfamlanddisp_el confothtown_el witchkilling_el sasycutl_el)
{txt}(15197 missing values generated)

{com}.  la var anyviol_el "Indicator for any violence (Table 7 col. 1-8)"
{txt}
{com}.  
.  egen sumviol_el = rowtotal(tribviol_el strkviol_el youthelder_el strkpeac_el interfamlanddisp_el confothtown_el witchkilling_el sasycutl_el), m
{txt}(15197 missing values generated)

{com}.  la var sumviol_el "Overall violence indicator (0-9) (Table 7 col. 1-8)"
{txt}
{com}.         
. 
. 
. replace tribviol_dum_el2 =      tribviol_el                             if (ENDLINE_LEADER == 1)
{txt}(940 real changes made)

{com}. replace strkviol_dum_el2 =      strkviol_el                             if (ENDLINE_LEADER == 1)
{txt}(940 real changes made)

{com}. replace pvytheld_dum_el2 =      youthelder_el                   if (ENDLINE_LEADER == 1)
{txt}(940 real changes made)

{com}. replace strkpeac_dum_el2 =      strkpeac_el                             if (ENDLINE_LEADER == 1)
{txt}(940 real changes made)

{com}. replace cfamlndcn_dum_el2 =     interfamlanddisp_el             if (ENDLINE_LEADER == 1)
{txt}(371 real changes made)

{com}. replace dtwnldcn_dum_el2 =      confothtown_el                  if (ENDLINE_LEADER == 1)
{txt}(940 real changes made)

{com}. replace suspwitc_dum_el2 =      witchkilling_el                 if (ENDLINE_LEADER == 1)
{txt}(940 real changes made)

{com}. replace sasycutl_dum_el2 =      sasycutl_el                             if (ENDLINE_LEADER == 1)
{txt}(940 real changes made)

{com}. replace sasywitch_el2    =      sasywitch_el                    if (ENDLINE_LEADER == 1)
{txt}(940 real changes made)

{com}. replace anyviol_el2      =      anyviol_el                              if (ENDLINE_LEADER == 1)
{txt}(372 real changes made)

{com}. replace sumviol_el2      =      sumviol_el                              if (ENDLINE_LEADER == 1)        
{txt}(940 real changes made)

{com}. 
. 
. ********************************************************************************
. * Make a log town size variable for endline 1 **********************************
. ********************************************************************************
. gen ctownhh_log_el=log(ctownhh_el)
{txt}(3 missing values generated)

{com}. 
. 
. 
. 
. 
. 
. 
. gen weight_e1_e2 = weight_ec2
{txt}
{com}. replace weight_e1_e2 = s_weight2 if resident_e1 == 1
{txt}(1,741 real changes made)

{com}. 
. 
. ********************************************************************************
. * Label all variables **********************************************************
. ********************************************************************************
. include do/label_vars
{txt}
{com}. 
. ********************************************************************************
. * Labeling variables ***********************************************************
. ********************************************************************************
. // Endline 1 variable
. label var jpc_attend_ec         "Attended program"
{txt}
{com}. 
. // treatment 
. label var months_treated                "Months since implementation"
{txt}
{com}. 
. // t2 
. // what the fuck does t2 mean? 
. // it means fucking land disputes. What the fuck. (land)"
. label var anylndconf_u_ec2              "Any serious land dispute"
{txt}
{com}. label var unrslv_lnd_conf_u_ec2 "Any unresolved land dispute"
{txt}
{com}. label var conf_m_house                  "Length of house dispute (months)"
{txt}
{com}. label var conf_m_farm                   "Length of farm dispute (months)"
{txt}
{com}. label var conf_length_max_u_ec2 "Length of maximum land conflict phantom{c -(}{c )-}"
{txt}
{com}. label var conf_length_mean_u_ec2        "Length of mean land conflict"
{txt}
{com}. label var conf_any_u_ec2                "Any threats, property damage, or violence"
{txt}
{com}. label var conf_threat_u_ec2     "\tab Threats"
{txt}
{com}. label var conf_damage_u_ec2     "\tab Property damage"
{txt}
{com}. label var conf_viol_u_ec2               "\tab Violence"
{txt}
{com}. label var conf_witch_u_ec2              "\tab Witchcraft"
{txt}
{com}. label var conf_any_c_ec2                "Any threats, property damage, or violence \phantom{c -(}{c )-}"
{txt}
{com}. label var forum_lastsuc_c_ec2   "Resolved land dispute"
{txt}
{com}. label var conf_forum_c_ec2              "\tab Number of forums used"
{txt}
{com}. label var forum_inf_suc_c_ec2   "\tab Resolved via informal mechanism"
{txt}
{com}. label var forum_lastsat_c_ec2   "\tab Satisfied with outcome"
{txt}
{com}. label var conf_length_max_c_ec2 "Length of maximum land conflict"
{txt}
{com}. label var conf_length_mean_c_ec2        "\tab Length of mean conflict"
{txt}
{com}. label var conf_damage_c_ec2     "\tab Property damage \phantom{c -(}{c )-}"
{txt}
{com}. label var conf_viol_c_ec2               "\tab Violence \phantom{c -(}{c )-}"
{txt}
{com}. label var conf_threat_c_ec2     "\tab Threats \phantom{c -(}{c )-}"
{txt}
{com}. label var conf_witch_c_ec2              "\tab Witchcraft \phantom{c -(}{c )-}"
{txt}
{com}. 
. // t2 
. // what the fuck does t3 mean? 
. // it means "all disputes" 
. // money, land, and gender
. label var lmg_conf_u_ec2                        "Any serious dispute"
{txt}
{com}. label var lmg_unrslv_conf_u_ec2         "Any unresolved dispute"
{txt}
{com}. label var lmg_conf_length_max_u_ec2     "Length of maximum conflict"
{txt}
{com}. label var lmg_conf_length_mean_u_ec2    "\quad Length of mean conflict"
{txt}
{com}. label var lmg_conf_any_u_ec2            "\phantom{c -(}{c )-} Any threats, property damage, or violence"
{txt}
{com}. label var lmg_conf_threat_u_ec2         "\quad Threats"
{txt}
{com}. label var lmg_conf_damage_u_ec2         "\quad Property damage"
{txt}
{com}. label var lmg_conf_viol_u_ec2           "\quad Violence"
{txt}
{com}. label var lmg_conf_witch_u_ec2          "\quad Witchcraft"
{txt}
{com}. label var lmg_forum_lastsuc_c_ec2       "Resolved dispute"
{txt}
{com}. label var lmg_conf_forum_c_ec2          "\quad Number of forums used"
{txt}
{com}. label var lmg_forum_inf_suc_c_ec2       "\quad Resolved via informal mechanism"
{txt}
{com}. label var lmg_forum_lastsat_c_ec2       "\quad Satisfied with outcome"
{txt}
{com}. label var lmg_conf_length_max_c_ec2     "Length of maximum conflict \phantom{c -(}{c )-}"
{txt}
{com}. label var lmg_conf_length_mean_c_ec2    "\quad Length of mean conflict \phantom{c -(}{c )-}"
{txt}
{com}. label var lmg_conf_times_ec2            "\quad Land dispute + gender dispute + money dispute"
{txt}
{com}. label var mnyconf_any_u_ec2                     "Any money conflict"
{txt}
{com}. label var wmconf_any_u_ec2                      "Any man-woman conflict"
{txt}
{com}. label var mnyconf_viol_u_ec2            "Violence in money conflict"
{txt}
{com}. label var wmconf_viol_u_ec2                     "Violence in man-woman conflict"
{txt}
{com}. label var lmg_conf_any_c_ec2        "\phantom{c -(}{c )-} Any threats, property damage, or violence \phantom{c -(}{c )-}"
{txt}
{com}. label var lmg_conf_dam_violence_bin_c "\quad Property damage or violence \phantom{c -(}{c )-}"
{txt}
{com}. label var lmg_conf_threat_c_ec2 "\quad Threats \phantom{c -(}{c )-}"
{txt}
{com}. label var lmg_conf_viol_c_ec2 "\quad Violence \phantom{c -(}{c )-}"
{txt}
{com}. label var lmg_conf_damage_c_ec2 "\quad Property damage \phantom{c -(}{c )-}"
{txt}
{com}. label var lmg_conf_witch_c_ec2 "\quad Witchcraft \phantom{c -(}{c )-}"
{txt}
{com}. 
. /*
> // Fallow land
> label var fallowland_farm               "Index of Fallow Land for farm"
> label var landrestpast                  "\quad Has ever let land rest"
> label var landrestfut                   "\quad Will let land rest in future"
> label var restseasons                   "\quad Num. of seasons to rest"
> label var securerest                    "\quad Level of security if land resting"
> label var size_farm                     "Size of farm"
> 
> label var security_rights               "Security rights index for house and farm"
> label var security_rights_farm  "\quad Security rights index for farm"
> label var security_rights_house "\quad Security rights index for house"
> 
> 
> label var improvez                              "Improvement index for house and farm"
> label var improvez_farm                 "\quad Improvement index for farm"
> label var improvez_house                "\quad Improvement index for house"
> 
> ********************************************************************************
> * Norms and Skills *************************************************************
> ********************************************************************************
> label var bias_index_ec2 "Bias index"
> label var defection_index_ec2 "Defection index"
> label var empathy_index_ec2 "Empathy index"
> label var forum_choice_index_ec2 "Forum choice index"
> label var managing_emotions_index_ec2 "Managing emotions index"
> label var mediation_index_ec2 "Mediation index"
> label var negotiation_index_ec2 "Negotiation index"
> 
> label var bias_index_el2 "Bias index"
> label var defection_index_el2 "Defection index"
> label var empathy_index_el2 "Empathy index"
> label var forum_choice_index_el2 "Forum choice index"
> label var managing_emotions_index_el2 "Managing emotions index"
> label var mediation_index_el2 "Mediation index"
> label var negotiation_index_el2 "Negotiation index"
> 
> 
> * Just residents ***************************************************************
> label var nospoilpropop_ec2             "\quad Thinks shouldn't spoil property"         
> label var nospoilpropco_ec2             "\quad Comm thinks shouldn't spoil property"
> label var skstaycalm_ec2                        "\quad Stays calm"
> label var skcooltemper_ec2                      "\quad Cools temper"
> label var sktalkbad_ec2                         "\quad Don't talk bad"
> label var sktalkpalava_ec2                      "\quad Talks with opposing side"
> label var sktalkgood_ec2                        "\quad Makes other side understand"
> label var skproposesolution_ec2         "\quad Proposes solution"
> label var skhelpunderstand_ec2          "\quad Helps others understand"
> label var skcooltemperothers_ec2        "\quad Cool others' temper"
> label var nosmalllieop_ec2                      "\quad Thinks bad to tell lies"
> label var nosmalllieco_ec2                      "\quad Comm. thinks bad to tell lies"
> label var skbringtogether_ec2           "\quad Bring others together"
> label var skhelpagree_ec2                       "\quad Help others agree"
> label var noadviseop_ec2                        "\quad Thinks good to ask friends for help"
> label var noadviseco_ec2                        "\quad Comm thinks good to ask friends for help"
> label var notalkfirstco_ec2             "\quad Thinks good to talk to others first"
> label var notalkfirstop_ec2             "\quad Comm. thinks good to talk to others first"
> label var nocommfirstop_ec2             "\quad Thinks good to talk"
> label var nocommfirstco_ec2             "\quad Comm. thinks good to talk"
> label var nopolicefirstco_ec2           "\quad Comm doesn't think okay to go to police first"
> label var nopolicefirstop_ec2           "\quad Doesn't think okay to go to police first"
> label var nomediateop_ec2                       "\quad Thinks its good to talk"
> label var nocompromop_ec2                       "\quad Comm. thinks its good to talk"
> label var nocompromco_ec2                       "\quad Thinks its good to talk"
> label var nogiftop_ec2                          "\quad Thinks gifts okay"
> label var nogiftco_ec2                          "\quad Comm. thinks gifts okay"
> label var sklisten_ec2                          "\quad Listens to other side"
> label var skconvincetalk_ec2            "\quad Convinces other to talk"
> label var skempathy_ec2                         "\quad Thinks about their side"
> label var skthinkwrong_ec2                      "\quad Thinks might be wrong"
> label var skthinkshoes_ec2                      "\quad Puts themselves in opposite shoes"
> label var nochiefsupportop_ec2          "\quad Thinks good to take palava to elders"
> label var nochiefsupportco_ec2          "\quad Comm. thinks good to take palava to elders"
> label var nopoliceop_ec2                        "\quad Doesn't think okay to take palava to police"
> label var nopoliceco_ec2                        "\quad Comm. doesnt think okay to take palava to police"
> label var nocontactsop_ec2                      "\quad Thinks bad to take palava to biased forum"
> label var nocontactsco_ec2                      "\quad Comm thinks bad to take palava to biased forum"
> label var notalkfirstop_ec2             "\quad Thinks good to go to good talkers first"
> label var notakesideop_ec2                      "\quad Thinks bad to take sides"
> label var notakesideco_ec2                      "\quad Comm thinks bad to take sides"
> label var norenegeop_ec2                        "\quad Thinks bad to renege"
> label var norenegeco_ec2                        "\quad Comm. thinks bad to renege"
> label var nohelpcompop_ec2                      "\quad Thinks okay to help others"
> label var nohelpcompco_ec2                      "\quad Comm thinks okay to help others"
> label var skcompromise_ec2                      "\quad Compromizes with other"
> label var skforgive_ec2                         "\quad Forgives others"
> label var nogossipop_ec2                        "\quad Thinks bad to gossip"
> label var nogossipco_ec2                        "\quad Comm. thinks bad to gossip"
> label var nomediateco_ec2                       "\quad Community brings people together in palava"
> 
> 
> *Standardized Residents ********************************************************
> label var nospoilpropop_st_ec2                  "\quad Thinks shouldn't spoil property (z-score)"
> label var nospoilpropco_st_ec2                  "\quad Comm thinks shouldn't spoil property (z-score)"
> label var skstaycalm_st_ec2                     "\quad Stays calm (z-score)"
> label var skcooltemper_st_ec2                   "\quad Cools temper (z-score)"
> label var sktalkbad_st_ec2                              "\quad Don't talk bad (z-score)"
> label var sktalkpalava_st_ec2                   "\quad Talks with opposing side (z-score)"
> label var sktalkgood_st_ec2                     "\quad Makes other side understand (z-score)"
> label var skproposesolution_st_ec2              "\quad Proposes solution (z-score)"
> label var skhelpunderstand_st_ec2               "\quad Helps others understand (z-score)"
> label var skcooltemperothers_st_ec2     "\quad Cool others' temper (z-score)"
> label var nosmalllieop_st_ec2                   "\quad Thinks bad to tell lies (z-score)"
> label var nosmalllieco_st_ec2                   "\quad Comm. thinks bad to tell lies (z-score)"
> label var skbringtogether_st_ec2                "\quad Bring others together (z-score)"
> label var skhelpagree_st_ec2                    "\quad Help others agree (z-score)"
> label var noadviseop_st_ec2                     "\quad Thinks good to ask friends for help (z-score)"
> label var noadviseco_st_ec2                     "\quad Comm thinks good to ask friends for help (z-score)"
> label var notalkfirstco_st_ec2                  "\quad Thinks good to talk to others first (z-score)"
> label var notalkfirstop_st_ec2                  "\quad Comm. thinks good to talk to others first (z-score)"
> label var nocommfirstop_st_ec2                  "\quad Thinks good to talk (z-score)"
> label var nocommfirstco_st_ec2                  "\quad Comm. thinks good to talk (z-score)"
> label var nopolicefirstco_st_ec2                "\quad Comm doesn't think okay to go to police first (z-score)"
> label var nopolicefirstop_st_ec2                "\quad Doesn't think okay to go to police first (z-score)"
> label var nomediateop_st_ec2                    "\quad Thinks its good to talk (z-score)"
> label var nocompromop_st_ec2                    "\quad Comm. thinks its good to talk (z-score)"
> label var nocompromco_st_ec2                    "\quad Thinks its good to talk (z-score)"
> label var nogiftop_st_ec2                               "\quad Thinks gifts okay (z-score)"
> label var nogiftco_st_ec2                               "\quad Comm. thinks gifts okay (z-score)"
> label var sklisten_st_ec2                               "\quad Listens to other side (z-score)"
> label var skconvincetalk_st_ec2                 "\quad Convinces other to talk (z-score)"
> label var skempathy_st_ec2                              "\quad Thinks about their side (z-score)"
> label var skthinkwrong_st_ec2                   "\quad Thinks might be wrong (z-score)"
> label var skthinkshoes_st_ec2                   "\quad Puts themselves in opposite shoes (z-score)"
> label var nochiefsupportop_st_ec2               "\quad Thinks good to take palava to elders (z-score)"
> label var nochiefsupportco_st_ec2               "\quad Comm. thinks good to take palava to elders (z-score)"
> label var nopoliceop_st_ec2                     "\quad Doesn't think okay to take palava to police (z-score)"
> label var nopoliceco_st_ec2                     "\quad Comm. doesn't think okay to take palava to police (z-score)"
> label var nocontactsop_st_ec2                   "\quad Thinks bad to take palava to biased forum (z-score)"
> label var nocontactsco_st_ec2                   "\quad Comm thinks bad to take palava to biased forum (z-score)"
> label var notalkfirstop_st_ec2                  "\quad Thinks good to go to good talkers first (z-score)"
> label var notakesideop_st_ec2                   "\quad Thinks bad to take sides (z-score)"
> label var notakesideco_st_ec2                   "\quad Comm thinks bad to take sides (z-score)"
> label var norenegeop_st_ec2                     "\quad Thinks bad to renege (z-score)"
> label var norenegeco_st_ec2                     "\quad Comm. thinks bad to renege (z-score)"
> label var nohelpcompop_st_ec2                   "\quad Thinks okay to help others (z-score)"
> label var nohelpcompco_st_ec2                   "\quad Comm thinks okay to help others (z-score)"
> label var skcompromise_st_ec2                   "\quad Compromizes with other (z-score)"
> label var skforgive_st_ec2                              "\quad Forgives others (z-score)"
> label var nogossipop_st_ec2                     "\quad Thinks bad to gossip (z-score)"
> label var nogossipco_st_ec2                     "\quad Comm. thinks bad to gossip (z-score)"
> label var nomediateco_st_ec2                    "\quad Community brings people together in palava (z-score)"
> 
> 
> * Leaders **********************************************************************
> label var nospoilpropop_el2             "\quad Thinks shouldn't spoil property"         
> label var nospoilpropco_el2             "\quad Comm thinks shouldn't spoil property"
> label var skstaycalm_el2                        "\quad Stays calm"
> label var skcooltemper_el2                      "\quad Cools temper"
> label var sktalkbad_el2                         "\quad Don't talk bad"
> label var sktalkpalava_el2                      "\quad Talks with opposing side"
> label var sktalkgood_el2                        "\quad Makes other side understand"
> label var skproposesolution_el2         "\quad Proposes solution"
> label var skhelpunderstand_el2          "\quad Helps others understand"
> label var skcooltemperothers_el2        "\quad Cool others' temper"
> label var nosmalllieop_el2                      "\quad Thinks bad to tell lies"
> label var nosmalllieco_el2                      "\quad Comm. thinks bad to tell lies"
> label var skbringtogether_el2           "\quad Bring others together"
> label var skhelpagree_el2                       "\quad Help others agree"
> label var noadviseop_el2                        "\quad Thinks good to ask friends for help"
> label var noadviseco_el2                        "\quad Comm thinks good to ask friends for help"
> label var notalkfirstco_el2             "\quad Thinks good to talk to others first"
> label var notalkfirstop_el2             "\quad Comm. thinks good to talk to others first"
> label var nocommfirstop_el2             "\quad Thinks good to talk"
> label var nocommfirstco_el2             "\quad Comm. thinks good to talk"
> label var nopolicefirstco_el2           "\quad Comm doesn't think okay to go to police first"
> label var nopolicefirstop_el2           "\quad Doesn't think okay to go to police first"
> label var nomediateop_el2                       "\quad Thinks its good to talk"
> label var nocompromop_el2                       "\quad Comm. thinks its good to talk"
> label var nocompromco_el2                       "\quad Thinks its good to talk"
> label var nogiftop_el2                          "\quad Thinks gifts okay"
> label var nogiftco_el2                          "\quad Comm. thinks gifts okay"
> label var sklisten_el2                          "\quad Listens to other side"
> label var skconvincetalk_el2            "\quad Convinces other to talk"
> label var skempathy_el2                         "\quad Thinks about their side"
> label var skthinkwrong_el2                      "\quad Thinks might be wrong"
> label var skthinkshoes_el2                      "\quad Puts themselves in opposite shoes"
> label var nochiefsupportop_el2          "\quad Thinks good to take palava to elders"
> label var nochiefsupportco_el2          "\quad Comm. thinks good to take palava to elders"
> label var nopoliceop_el2                        "\quad Doesn't think okay to take palava to police"
> label var nopoliceco_el2                        "\quad Comm. doesn't think okay to take palava to police"
> label var nocontactsop_el2                      "\quad Thinks bad to take palava to biased forum"
> label var nocontactsco_el2                      "\quad Comm thinks bad to take palava to biased forum"
> label var notalkfirstop_el2             "\quad Thinks good to go to good talkers first"
> label var notakesideop_el2                      "\quad Thinks bad to take sides"
> label var notakesideco_el2                      "\quad Comm thinks bad to take sides"
> label var norenegeop_el2                        "\quad Thinks bad to renege"
> label var norenegeco_el2                        "\quad Comm. thinks bad to renege"
> label var nohelpcompop_el2                      "\quad Thinks okay to help others"
> label var nohelpcompco_el2                      "\quad Comm thinks okay to help others"
> label var skcompromise_el2                      "\quad Compromizes with other"
> label var skforgive_el2                         "\quad Forgives others"
> label var nogossipop_el2                        "\quad Thinks bad to gossip"
> label var nogossipco_el2                        "\quad Comm. thinks bad to gossip"
> label var nomediateco_el2                       "\quad Community brings people together in palava"
> 
> 
> * Standardized Leaders *********************************************************
> label var nospoilpropop_st_el2                  "\quad Thinks shouldn't spoil property (z-score)"
> label var nospoilpropco_st_el2                  "\quad Comm thinks shouldn't spoil property (z-score)"
> label var skstaycalm_st_el2                     "\quad Stays calm (z-score)"
> label var skcooltemper_st_el2                   "\quad Cools temper (z-score)"
> label var sktalkbad_st_el2                              "\quad Don't talk bad (z-score)"
> label var sktalkpalava_st_el2                   "\quad Talks with opposing side (z-score)"
> label var sktalkgood_st_el2                     "\quad Makes other side understand (z-score)"
> label var skproposesolution_st_el2              "\quad Proposes solution (z-score)"
> label var skhelpunderstand_st_el2               "\quad Helps others understand (z-score)"
> label var skcooltemperothers_st_el2     "\quad Cool others' temper (z-score)"
> label var nosmalllieop_st_el2                   "\quad Thinks bad to tell lies (z-score)"
> label var nosmalllieco_st_el2                   "\quad Comm. thinks bad to tell lies (z-score)"
> label var skbringtogether_st_el2                "\quad Bring others together (z-score)"
> label var skhelpagree_st_el2                    "\quad Help others agree (z-score)"
> label var noadviseop_st_el2                     "\quad Thinks good to ask friends for help (z-score)"
> label var noadviseco_st_el2                     "\quad Comm thinks good to ask friends for help (z-score)"
> label var notalkfirstco_st_el2                  "\quad Thinks good to talk to others first (z-score)"
> label var notalkfirstop_st_el2                  "\quad Comm. thinks good to talk to others first (z-score)"
> label var nocommfirstop_st_el2                  "\quad Thinks good to talk (z-score)"
> label var nocommfirstco_st_el2                  "\quad Comm. thinks good to talk (z-score)"
> label var nopolicefirstco_st_el2                "\quad Comm thinks good to go to police first (z-score)"
> label var nopolicefirstop_st_el2                "\quad Tinks good to go to police first (z-score)"
> label var nomediateop_st_el2                    "\quad Thinks its good to talk (z-score)"
> label var nocompromop_st_el2                    "\quad Comm. thinks its good to talk (z-score)"
> label var nocompromco_st_el2                    "\quad Thinks its good to talk (z-score)"
> label var nogiftop_st_el2                               "\quad Thinks gifts okay (z-score)"
> label var nogiftco_st_el2                               "\quad Comm. thinks gifts okay (z-score)"
> label var sklisten_st_el2                               "\quad Listens to other side (z-score)"
> label var skconvincetalk_st_el2                 "\quad Convinces other to talk (z-score)"
> label var skempathy_st_el2                              "\quad Thinks about their side (z-score)"
> label var skthinkwrong_st_el2                   "\quad Thinks might be wrong (z-score)"
> label var skthinkshoes_st_el2                   "\quad Puts themselves in opposite shoes (z-score)"
> label var nochiefsupportop_st_el2               "\quad Thinks good to take palava to elders (z-score)"
> label var nochiefsupportco_st_el2               "\quad Comm. thinks good to take palava to elders (z-score)"
> label var nopoliceop_st_el2                     "\quad Thinks good to take palava to police (z-score)"
> label var nopoliceco_st_el2                     "\quad Comm. thinks good to take palava to police (z-score)"
> label var nocontactsop_st_el2                   "\quad Thinks bad to take palava to biased forum (z-score)"
> label var nocontactsco_st_el2                   "\quad Comm thinks bad to take palava to biased forum (z-score)"
> label var notalkfirstop_st_el2                  "\quad Thinks good to go to good talkers first (z-score)"
> label var notakesideop_st_el2                   "\quad Thinks bad to take sides (z-score)"
> label var notakesideco_st_el2                   "\quad Comm thinks bad to take sides (z-score)"
> label var norenegeop_st_el2                     "\quad Thinks bad to renege (z-score)"
> label var norenegeco_st_el2                     "\quad Comm. thinks bad to renege (z-score)"
> label var nohelpcompop_st_el2                   "\quad Thinks okay to help others (z-score)"
> label var nohelpcompco_st_el2                   "\quad Comm thinks okay to help others (z-score)"
> label var skcompromise_st_el2                   "\quad Compromizes with other (z-score)"
> label var skforgive_st_el2                              "\quad Forgives others (z-score)"
> label var nogossipop_st_el2                     "\quad Thinks bad to gossip (z-score)"
> label var nogossipco_st_el2                     "\quad Comm. thinks bad to gossip (z-score)"
> label var nomediateco_st_el2                    "\quad Community brings people together in palava (z-score)"
> 
> 
> ********************************************************************************
> * Variables bout community disputes ********************************************
> ********************************************************************************
> label var anyviol_el2                           "Any Violence"
> label var sumviol_el2                           "Level of community violence"
> label var tribviol_dum_el2                      "\quad Intertribal violence"
> label var strkviol_dum_el2                      "\quad Violent strike or protest"
> label var pvytheld_dum_el2              "\quad Youth-elder dispute"
> label var strkpeac_dum_el2                      "\quad Peaceful strike or protest"
> label var cfamlndcn_dum_el2             "\quad Interfamily land disputes"
> label var dtwnldcn_dum_el2              "\quad Conflicts with other towns"
> label var suspwitc_dum_el2                      "\quad Witch hunts"
> label var sasycutl_dum_el2                      "\quad Trial by ordeal"
{txt}
{com}. 
. ********************************************************************************
. * Rename variables to make the reshape easier in the next step *****************
. ********************************************************************************
. drop mny_cause_other_payback    
{txt}
{com}. drop mny_cause_i_payback                
{txt}
{com}. drop mny_cause_other_stole      
{txt}
{com}. drop mny_cause_i_stole          
{txt}
{com}. drop mny_cause_other_cheated    
{txt}
{com}. drop mny_cause_i_cheated                
{txt}
{com}. drop mny_cause_other_issue      
{txt}
{com}. 
. 
. drop self_suff_bc
{txt}
{com}. rename improvez_*               z_improvement_*
{res}{txt}
{com}. rename improve_*                improvement_*
{res}{txt}
{com}. rename mny_*                    monetary_improvement_*
{res}{txt}
{com}. rename nonmoney_*               non_monetary_improvement_*
{res}{txt}
{com}. rename secured_*                level_of_security_*
{res}{txt}
{com}. rename fallowland_*     fallow_index_*
{res}{txt}
{com}. rename distenure_*              non_market_tenure_*
{res}{txt}
{com}. rename markettenure_*   market_tenure_*
{res}{txt}
{com}. rename nonkin_*                 non_kin_*
{res}{txt}
{com}. rename self_*                   ownership_self_*
{res}{txt}
{com}. rename selffam_*                ownership_fam_*
{res}{txt}
{com}. 
. 
. ********************************************************************************
. * Save this dataset and never worry about this monstrous code again ************
. ********************************************************************************
. save data/ready_analysis, replace
{txt}(note: file data/ready_analysis.dta not found)
file data/ready_analysis.dta saved

{com}. 
. /********************************************************************************
> 
> *******************************************************************************/
. 
{txt}end of do-file

{com}. 
. 
. ********************************************************************************
. * Do the Reshaping *************************************************************
. ********************************************************************************
. /*
>         *       Reshapes with respect to farm and house 
>                 *       "other" plot types are not in any of the reshaping codes in the 
>                         original analysis file
>         *       Labels all the new variables from the reshape
> */
.         do do/reshaping
{txt}
{com}. 
. ********************************************************************************
. * Make a long version of the analysis data *************************************
. ********************************************************************************
. /*      Here long means plot-level. This is for analyzing the effect on investment /
>         security for different plots. 
> */
.         
.         use data/ready_analysis, clear
{txt}
{com}.         keep if ENDLINE2_RESIDENT == 1
{txt}(12,125 observations deleted)

{com}. 
.         set more off
{txt}
{com}.         cap drop newid
{txt}
{com}.         cap drop finalid
{txt}
{com}.         cap egen newid = group(respid)
{txt}
{com}.         cap gen finalid = string(newid) + string(ENDLINE2_RESIDENT)
{txt}
{com}.         drop newid
{txt}
{com}.         duplicates drop finalid, force

{p 0 4}{txt}Duplicates in terms of {res} finalid{p_end}

{txt}(0 observations are duplicates)

{com}.         cap drop survey_et
{txt}
{com}. 
.         cap drop security_rights
{txt}
{com}. /*      Something about stata's namespace makes there be a conflict between stuff
>         called "survey" and other stuff. I don't fully understand it, but we
>         rename the survey variable just in case. 
> */
. 
. cap drop monetary_improvement_rslv_conf monetary_improvement_unrslv_conf monetary_improvement_rslv_infrml monetary_improvement_stsfd
{txt}
{com}. 
. drop survey surveytype
{txt}
{com}. 
. 
. gl outcomes_for_reshape ///
>         z_improvement                   ///
>         improvement                     ///
>         improveexisting         ///
>         improvenew                      ///
>         improvegut                      ///
>         improvefence            ///
>         improvetree                     ///
>         monetary_improvement                            ///
>         spentexisting           ///
>         spentnew                        ///
>         spentgut                        ///
>         spentfence                      ///
>         spenttree                       ///
>         non_monetary_improvement                        ///
>         daysexisting            ///
>         daysnew                         ///
>         acresgut                        ///
>         acresfence                      ///
>         acrestree                       ///
>         security_rights         ///
>         secured                         ///
>         inherit                         ///
>         survey                  ///
>         sell                            ///
>         pawn                            ///
>         level_of_security                       ///
>         fallow_index                    ///
>         non_market_tenure               ///
>         market_tenure           ///
>         non_kin                         ///
>         ownership_self          ///
>         ownership_fam           ///
>         size
{txt}
{com}. 
. drop sizec50
{txt}
{com}. 
.         reshape long $outcomes_for_reshape, i(finalid) j(plottype, string)
{txt}(note: j = _farm _house)
(note: improveexisting_farm not found)
(note: improvenew_farm not found)
(note: spentexisting_farm not found)
(note: spentnew_farm not found)
(note: daysexisting_farm not found)
(note: daysnew_farm not found)
(note: secured_farm not found)
(note: improvegut_house not found)
(note: improvefence_house not found)
(note: improvetree_house not found)
(note: spentgut_house not found)
(note: spentfence_house not found)
(note: spenttree_house not found)
(note: acresgut_house not found)
(note: acresfence_house not found)
(note: acrestree_house not found)
(note: secured_house not found)
(note: fallow_index_house not found)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    4012   {txt}->{res}    8024
{txt}Number of variables            {res}    4856   {txt}->{res}    4842
{txt}j variable (2 values)                     ->   {res}plottype
{txt}xij variables:
 {res}z_improvement_farm z_improvement_house   {txt}->   {res}z_improvement
     improvement_farm improvement_house   {txt}->   {res}improvement
improveexisting_farm improveexisting_house{txt}->   {res}improveexisting
       improvenew_farm improvenew_house   {txt}->   {res}improvenew
       improvegut_farm improvegut_house   {txt}->   {res}improvegut
   improvefence_farm improvefence_house   {txt}->   {res}improvefence
     improvetree_farm improvetree_house   {txt}->   {res}improvetree
monetary_improvement_farm monetary_improvement_house{txt}->{res}monetary_improvement
 spentexisting_farm spentexisting_house   {txt}->   {res}spentexisting
           spentnew_farm spentnew_house   {txt}->   {res}spentnew
           spentgut_farm spentgut_house   {txt}->   {res}spentgut
       spentfence_farm spentfence_house   {txt}->   {res}spentfence
         spenttree_farm spenttree_house   {txt}->   {res}spenttree
non_monetary_improvement_farm non_monetary_improvement_house{txt}->{res}non_monetary_improvement
   daysexisting_farm daysexisting_house   {txt}->   {res}daysexisting
             daysnew_farm daysnew_house   {txt}->   {res}daysnew
           acresgut_farm acresgut_house   {txt}->   {res}acresgut
       acresfence_farm acresfence_house   {txt}->   {res}acresfence
         acrestree_farm acrestree_house   {txt}->   {res}acrestree
security_rights_farm security_rights_house{txt}->   {res}security_rights
             secured_farm secured_house   {txt}->   {res}secured
             inherit_farm inherit_house   {txt}->   {res}inherit
               survey_farm survey_house   {txt}->   {res}survey
                   sell_farm sell_house   {txt}->   {res}sell
                   pawn_farm pawn_house   {txt}->   {res}pawn
level_of_security_farm level_of_security_house{txt}->{res}level_of_security
   fallow_index_farm fallow_index_house   {txt}->   {res}fallow_index
non_market_tenure_farm non_market_tenure_house{txt}->{res}non_market_tenure
 market_tenure_farm market_tenure_house   {txt}->   {res}market_tenure
             non_kin_farm non_kin_house   {txt}->   {res}non_kin
ownership_self_farm ownership_self_house  {txt}->   {res}ownership_self
 ownership_fam_farm ownership_fam_house   {txt}->   {res}ownership_fam
                   size_farm size_house   {txt}->   {res}size
{txt}{hline 77}

{com}. 
.         // 6 is not an important number. Just longer than both the words "house" and "farm"
.         replace plottype = substr(plottype, 2, 6)
{txt}(8,024 real changes made)

{com}. 
. 
. label var z_improvement                         "Property investment index, z-score"
{txt}
{com}. label var monetary_improvement          "\quad Monetary value of improvement, house and farm, (z-score)"
{txt}
{com}. label var non_monetary_improvement      "\quad Non-monetary improvement, house and farm (z-score)"
{txt}
{com}. label var improvement                           "\quad Made an improvement, house and farm"
{txt}
{com}. 
. label var improveexisting                       "Improved Existing house"
{txt}
{com}. label var improvenew                            "Built a new house"
{txt}
{com}. label var improvegut                            "Improved gutter in farm"
{txt}
{com}. label var improvefence                          "Improved fence in farm"
{txt}
{com}. label var improvetree                           "Improved tree in farm"
{txt}
{com}. label var spentexisting                         "Amount spent on existing house (USD)"
{txt}
{com}. label var spentnew                                      "Amount spent on new house (USD)"
{txt}
{com}. label var spentgut                                      "Amount spent on gutter in farm (USD)"
{txt}
{com}. label var spentfence                            "Amount spent on fence in farm (USD)"
{txt}
{com}. label var spenttree                                     "Amount spent on tree in farm (USD)"
{txt}
{com}. label var daysexisting                          "Days spent improving existing house"
{txt}
{com}. label var daysnew                                       "Days spent building new house"
{txt}
{com}. label var acresgut                                      "Acres affected by gutter improvements in farm" 
{txt}
{com}. label var acresfence                            "Acres affected by fence improvement in farm"
{txt}
{com}. label var acrestree                                     "Acres affected by tree improvement in farm"
{txt}
{com}. 
. 
. label var security_rights                       "Security index through rights"
{txt}
{com}. label var inherit                                       "\quad Has ability to inherit, house and farm"
{txt}
{com}. label var sell                                          "\quad Has ability to sell, house and farm"
{txt}
{com}. label var pawn                                          "\quad Has ability to pawn, house and farm"
{txt}
{com}. label var survey                                        "\quad Has ability to survey, house and farm"
{txt}
{com}. label var level_of_security                     "\quad Level of security of boundaries, house and farm"
{txt}
{com}. label var fallow_index                          "Index of fallow land, farm"
{txt}
{com}. label var non_market_tenure                     "Access to land through non-market, house and farm"
{txt}
{com}. label var market_tenure                         "Access to land through market, house and farm"
{txt}
{com}. label var non_kin                                       "Did not receive from family member, house and farm"
{txt}
{com}. label var ownership_self                "Individual owns land"
{txt}
{com}. label var ownership_fam         "Individual or family owns land"
{txt}
{com}. label var size                          "Size of land (house and farm)"
{txt}
{com}. 
. 
. 
. ********************************************************************************
. * Drop one observation for variables without plot-level variation **************
. ********************************************************************************
. /*      Some variables are about land but are not tied to a farm or house 
>         specifically. When we do the reshape, the observations for these variables 
>         double. To counteract this, we just set that variable to missing when the 
>         plottype is a house. This is hacky, but it makes code easier down the line. 
> */
. 
. local vars_to_drop_one_obs farm_size_ec2 anylndconf_u_ec2  lmg_conf_any_u_ec2 size
{txt}
{com}. foreach variable in `vars_to_drop_one_obs' {c -(}
{txt}  2{com}.         replace `variable' = . if (plottype == "house")
{txt}  3{com}. {c )-}
{txt}(4,012 real changes made, 4,012 to missing)
(4,012 real changes made, 4,012 to missing)
(4,012 real changes made, 4,012 to missing)
(3,813 real changes made, 3,813 to missing)

{com}. 
. 
. 
. save data/ready_analysis_plots, replace
{txt}(note: file data/ready_analysis_plots.dta not found)
file data/ready_analysis_plots.dta saved

{com}. 
. 
. 
{txt}end of do-file

{com}. 
. 
. ********************************************************************************
. * Perform all the analyses *****************************************************
. ********************************************************************************
. /*      *       Uses the "ready_analysis" .dta file created in the cleaning code 
> */
.         do do/analysis
{txt}
{com}. ********************************************************************************
. * Set the directory for the frmttable ado file *********************************
. ********************************************************************************
. qui adopath ++ ./ado
{txt}
{com}. 
. ********************************************************************************
. * Import the analysis dataset **************************************************
. ********************************************************************************
. use data/ready_analysis, clear
{txt}
{com}. 
. ********************************************************************************
. * Set globals for analysis *****************************************************
. ********************************************************************************
. * Set the control variables
. qui do do/set_controls 
{txt}
{com}. * Set the outcome variables 
. qui do do/set_outcomes
{txt}
{com}. 
. ********************************************************************************
. * Initialize the ATE maker program *********************************************
. ********************************************************************************
. qui do do/tables_do/ate_maker
{txt}
{com}. qui do do/tables_do/adjust_p_values
{txt}
{com}. qui do do/tables_do/ate_maker_year
{txt}
{com}. set more off
{txt}
{com}. 
. * Also initialize the summary table program ************************************
. qui do do/tables_do/summary_table
{txt}
{com}. 
. ********************************************************************************
. * Make summary statistics of all covariates ************************************
. ********************************************************************************
. qui summary_table $C_ec2, filename(covariates_resident) subset($L1)
{err}                FmtStr():  3499  StrToMat() not found
              FrmtFill():     -  function returned error
                 <istmt>:     -  function returned error
{txt}{search r(3499), local:r(3499);}

end of do-file
{search r(3499), local:r(3499);}

end of do-file

{search r(3499), local:r(3499);}

{com}. ssc install outreg2, replace
{txt}checking {hilite:outreg2} consistency and verifying not already installed...
installing into /home/pdeffebach/ado/plus/...
installation complete.

{com}. do do/analysis
{txt}
{com}. ********************************************************************************
. * Set the directory for the frmttable ado file *********************************
. ********************************************************************************
. qui adopath ++ ./ado
{txt}
{com}. 
. ********************************************************************************
. * Import the analysis dataset **************************************************
. ********************************************************************************
. use data/ready_analysis, clear
{txt}
{com}. 
. ********************************************************************************
. * Set globals for analysis *****************************************************
. ********************************************************************************
. * Set the control variables
. qui do do/set_controls 
{txt}
{com}. * Set the outcome variables 
. qui do do/set_outcomes
{txt}
{com}. 
. ********************************************************************************
. * Initialize the ATE maker program *********************************************
. ********************************************************************************
. qui do do/tables_do/ate_maker
{txt}
{com}. qui do do/tables_do/adjust_p_values
{txt}
{com}. qui do do/tables_do/ate_maker_year
{txt}
{com}. set more off
{txt}
{com}. 
. * Also initialize the summary table program ************************************
. qui do do/tables_do/summary_table
{txt}
{com}. 
. ********************************************************************************
. * Make summary statistics of all covariates ************************************
. ********************************************************************************
. qui summary_table $C_ec2, filename(covariates_resident) subset($L1)
{err}                FmtStr():  3499  StrToMat() not found
              FrmtFill():     -  function returned error
                 <istmt>:     -  function returned error
{txt}{search r(3499), local:r(3499);}

end of do-file

{search r(3499), local:r(3499);}

{com}. version
{txt}version 15.0

{com}. 